<!-- eslint-disable no-tabs -->
<template>
<!-- 主視覺 -->
<div class="shortKv">
    <div class="fill-shortKv topimg-OnLineApply">
        <div class="container-xl shortKv-title-4">
            <h2>線上辦卡</h2>
        </div>
    </div>
</div>
<!-- 主要內容 -->
<section class="mainArea">
  <div class="container-xl">
    <div class="row justify-content-md-center pt-1 pt-md-3">
        <div class="formGroup">
            <ul class="formList">
                <li class="form-group">
                    <label class="label" for="">申請人身份證號</label>
                    <div class="form-text">A12345****</div>
                </li>
                <li class="form-group">
                    <label class="label" for="">西元出生年月日</label>
                    <div class="form-text">1977/06/28</div>
                </li>
            </ul>
        </div>
        <div class="Apply_Chk mb-5">
              <div class="col-12 Apply_banksGroup">
                您可使用以下指定銀行所發行之正卡信用卡進行身分驗證(僅用於身分驗證，不能當財力證明使用)<br>
                <span class="blue_text">指定銀行：玉山銀行、永豐銀行、遠東商銀、日盛商銀、台新商銀、星展銀行、新光商銀、元大銀行、陽信銀行、華泰銀行、三信商銀、華南商銀、樂天信用卡、台中商銀、滙豐銀行、花旗銀行、土地銀行、合作金庫、臺灣中小企銀、彰化銀行、高雄銀行、臺灣銀行、台北富邦銀行、中國信託、兆豐商銀、凱基銀行、國泰世華、渣打商銀、上海商銀、安泰商銀等。</span>
              </div>
        </div>
        <Form
            v-slot="{errors}"
            ref="myForm"
            >
          <div class="formGroup">
              <ul class="formList Apply_Chk">
                  <li class="col-12 align-items-start" id="group1">
                      <label for="">信用卡卡號</label>
                      <div class="d-flex flex-column">
                        <div class="d-flex align-items-center">
                            <Field
                            v-model="cardNumber.code1"
                            name="code1"
                            id="cardCode1" ref="cardCode1"
                            type="text" maxlength="4"
                            class="cardNumber form-control"
                            :class="{ 'is-invalid': errors['卡號'] }"
                            @keyup="cardNumber.code1 = $custom.validate.OnlyNumPress(cardNumber.code1)"
                            @change="checkValue($refs.myForm,cardNumber,'卡號','cardCode2')"
                            />
                            <div class="cardDash text-center mx-1"></div>
                            <Field
                            v-model="cardNumber.code2"
                            name="code2"
                            id="cardCode2" ref="cardCode2"
                            type="password" maxlength="4"
                            class="cardNumber form-control"
                            :class="{ 'is-invalid': errors['卡號'] }"
                            @keyup="cardNumber.code2 = $custom.validate.OnlyNumPress(cardNumber.code2)"
                            @change="checkValue($refs.myForm,cardNumber,'卡號','cardCode3')"
                            />
                            <div class="cardDash text-center mx-1"></div>
                            <Field
                            v-model="cardNumber.code3"
                            name="code3"
                            id="cardCode3" ref="cardCode3"
                            type="password" maxlength="4"
                            class="cardNumber form-control"
                            :class="{ 'is-invalid': errors['卡號'] }"
                            @keyup="cardNumber.code3 = $custom.validate.OnlyNumPress(cardNumber.code3)"
                            @change="checkValue($refs.myForm,cardNumber,'卡號','cardCode4')"
                            />
                            <div class="cardDash text-center mx-1"></div>
                            <Field
                            v-model="cardNumber.code4"
                            name="code4"
                            id="cardCode4" ref="cardCode4"
                            type="text" maxlength="4"
                            class="cardNumber form-control"
														:class="{ 'is-invalid': errors['卡號'] }"
                            @keyup="cardNumber.code4 = $custom.validate.OnlyNumPress(cardNumber.code4)"
														@change="checkValue($refs.myForm,cardNumber,'卡號','validThru')"
                            />
                        </div>
                        <div class="d-flex text-center invalid-feedback my-1" >
                          {{errors['卡號']}}
                        </div>
                      </div>
                  </li>
                  <li class="col-12 align-items-start">
                      <label for="" class="mt-1">信用卡有效期限</label>
                      <div class="d-flex flex-column">
                          <Field
                          v-model="validThru"
                          id="validThru" name="validThru" ref="validThru"
                          type="text" maxlength="4"
                          class="Apply_Chk_form_control form-control"
                          :class="{ 'is-invalid': errors['信用卡有效期限'] }"
                          @keyup="validThru = $custom.validate.OnlyNumPress(validThru)"
                          @focus="validThru=''"
													@change="checkValue($refs.myForm,validThru,'信用卡有效期限','CSC')"/>
                          <span class="not_text">例如:2017年1月，請輸入0117</span>
													<div class="d-flex text-center invalid-feedback my-1" >
														{{errors['信用卡有效期限']}}
													</div>
                      </div>
                  </li>
                  <li class="col-12 align-items-start">
                      <label for="input1">信用卡背後末三碼</label>
                      <div class="d-flex flex-column">
                        <Field
                        v-model="CSC"
                        id="CSC" name="CSC" ref="CSC"
                        type="text" maxlength="3"
                        class="Apply_Chk_form_control form-control"
                        :class="{ 'is-invalid': errors['信用卡背後末三碼'] }"
                        @keyup="CSC = $custom.validate.OnlyNumPress(CSC)"
                        @focus="CSC=''"
                        @change="checkValue($refs.myForm,CSC,'信用卡背後末三碼','手機')"
                        />
                        <div class="d-flex text-center invalid-feedback my-1" >
                        {{errors['信用卡背後末三碼']}}
                        </div>
                      </div>
                  </li>
                  <!-- <li class="col-12 align-items-start">
                      <label for="" class="mt-1">行動電話</label>
                      <div class="d-flex flex-column">
                          <Field
                          v-model="phoneNumber"
                          id="手機" name="手機" ref="手機"
                          type="text" maxlength="10"
                          class="Apply_Chk_form_control form-control"
                          :class="{ 'is-invalid': errors['手機'] }"
                          @keyup="phoneNumber = $custom.validate.OnlyNumPress(phoneNumber)"
                          @focus="phoneNumber=''"
                          rules="checkPhone"
                          />
                          <span class="not_text">請填寫信用卡申請時之行動電話，以利資訊驗證</span>
                          <div class="d-flex text-center invalid-feedback my-1" >
                            {{errors['手機']}}
                          </div>
                      </div>
                  </li> -->
              </ul>
          </div>
        <div class="terms-group">
            <div class="terms">
                <Field
                  v-model="agreementAll"
                  id="checkbox1" name="服務申請約定條款"
                  type="checkbox"
                  class="checkimg position-absolute"
                  :class="{ 'is-invalid': errors['服務申請約定條款'] }"
                  @click="checkAgreement"
                  rules="required"
                  />
                <label for="checkbox1">同意，本人對「 <a href="#" @click.prevent="checkAgreement"><u>用卡須知及申請說明</u></a>」「 <a href="#" @click.prevent="checkAgreement"><u>重要告知事項</u></a>」「 <a href="#" @click.prevent="checkAgreement"><u>聯邦信用卡約定條款</u></a>」「<a href="#" @click.prevent="checkAgreement"><u>電子化帳單服務約定條款</u></a>」內容。(請務必勾選)
                </label>
                <div class="d-flex text-center invalid-feedback my-1" >
                  {{errors['服務申請約定條款']}}
                </div>
            </div>
            <div class="terms">
                <Field
                  v-model="checkagree"
                  id="agree1" name="信用卡基本資料使用同意"
                  type="checkbox"
                  class="checkimg position-absolute"
                  :class="{ 'is-invalid': errors['信用卡基本資料使用同意'] }"
                  @click="toggle"
                  value="agree"
                  rules="required"
                />
                <label for="checkbox2">同意，聯邦商業銀行股份有限公司將本人之基本資料(含身分證字號、信用卡卡號、信用卡有效期限、卡片背面簽名後三碼、行動電話等資料)，透過信用卡授權轉接處理中心(聯合信用卡處理中心)傳輸至發卡機構進行身分認證等相關作業。
                </label>
                <div class="d-flex text-center invalid-feedback my-1">
                  {{errors['信用卡基本資料使用同意']}}
                </div>
            </div>
        </div>
        <!-------------------//本人已詳閱---------------------->
        <div class="text-center button_group">
            <button
            @click.prevent="applySubmit($refs.myForm)"
            class="btn btn-primary btn-lg mx-1"
            type="buttom"
            >
            下一步
            </button>
        </div>
        </Form>
        <!-------------------本人已詳閱---------------------->
    </div>
  </div>
  <!-- Modal-1 -->
  <div ref="agreeModal" class="modal fade" id="exampleModal" tabindex="-1" aria-labelledby="exampleModalLabel" aria-hidden="true">
    <div class="modal-dialog" role="document">
      <div class="modal-content">
          <div class="modal-header">
              <h5 class="modal-title" id="exampleModalLabel-1">請向下滾動，仔細閱讀整份同意書所有內容<input id="myCheckCount" hidden></h5>
              <button type="button" class="btn-close" aria-label="Close" @click="this.agreeModal.hide()">
                <img src="@/assets/images/close.png" border="0" alt="close" >
              </button>
          </div>
          <div class="modal-body">
            <!------------------1-------------------------------------------->
            <div ref="termBox1" id="terms_box_1" class="terms_box">
                <!--uc1:wuc用卡須知及申請說明 runat="server" id="wuc用卡須知及申請說明" /-->
                <div class="txt">
                    <h3>用卡須知</h3>
                    在您決定向本行申請信用卡時，請您務必詳讀以下事項：
                    <div class="level-one">
                        <div class="cjk-ideographic">
                            一、循環信用利息及手續費
                            <div class="level-two">
                                <p class="red">
                                    (一) 持卡人每期最低應繳金額為以下項次金額合計（若前二款金額合計低於新臺幣1,000元，前二款金額以 1,000元計收）：
                                    <ol class="red">
                                        <li>當期新增一般消費金額及預借現金類產品（係指ATM、電話、臨櫃及網路等）金額百分之十，其它專案型預借現金商品依個別約定條款約定。</li>
                                        <li>前期循環信用餘額之百分之五。</li>
                                        <li>持卡人每期應付之基金、分期本金。</li>
                                        <li>前各期逾期未付最低應繳款項之總和。</li>
                                        <li>超過信用卡額度之款項。</li>
                                        <li>循環信用利息及年費、預借現金手續費、掛失補發手續費、調閱簽帳單手續費等其他應繳費用。</li>
                                        <li>本行依持卡人數整體信用往來狀況，據以核發信用額度1萬6,000元國民旅遊卡之當期應繳帳款。</li>
                                        <li>其他經主管機關規定應納入最低應繳金額之交易金額。</li>
                                    </ol>
                                </p>
                                <p>
                                    (二) 循環信用利息之計算，以各筆帳款入帳日為起息日
                                    <ol>
                                        <li>持卡人使用循環利息，本行信用卡循環利息之利息起算日為『入帳日』，所謂『入帳日』：指本行代持卡人付款項予收單機構或特約商店或為您負擔墊款義務或將餘額代償款項撥至持卡人所指定帳戶，並登錄於本行帳務之日，與『結帳日』、『繳款截止日』不同。</li>
                                        <li>因『入帳日』為本行實際為您給付款項予商店或撥款交付之日，本行之資金成本隨之產生，故循環信用利息 由此時開始起算。</li>
                                    </ol>
                                </p>
                                <p>(三)
                                    本行現採各筆帳款之入帳日為起息日，各筆循環信用利息之計算，係將每筆「得計入循環信用本金之帳款」，自各筆帳款入帳日起（每期應付分期本金遲延利息之計算，係自繳款截止日起計算），就該帳款之金額以帳款入帳日時適用之約定利率計算至該筆帳款結清之日止（元以下四捨五入），惟繳款後剩餘未付款項不足新臺幣1,000元，則各筆帳款入帳日後發生之循環信用利息及違約金，不予計收。</p>
                                <p class="red">(四)
                                    本行將視持卡人往來狀況及金融機構之債信情形綜合評斷結果，包含但不限於繳款紀錄、使用情形、債信紀錄、負債情形及收支比等因素訂定信用卡差別利率及其期間，並以考量資金成本、營運成本為由，調整持卡人所適用之利率。循環信用利率依貴行每季定期覆審之結果進行調整。
                                </p>
                                <p>
                                    (五) 如持卡人未能於每月繳款截止日前付清當期最低應繳金額或遲誤繳款期限者，本行得加計違約金或催收費用，各帳單週期之違約金計算方式為：
                                    <ol class="red">
                                        <li>逾期第一期者，應繳納違約金新臺幣300元</li>
                                        <li>連續逾期第二期者，應繳納違約金新臺幣400元。</li>
                                        <li>連續逾期第三期者，應繳納違約金新臺幣500元。</li>
                                    </ol>
                                    <span class="red">持卡人違反約定連續達三期(含)以上者，其違約金之計收最高以三期為限。</span><br>
                                    計息範例如下：
                                    <br>
                                    例：小蓮之信用卡消費明細表（帳單）結帳日為每月3日，繳款截止日為每月18日，2月份小蓮信用卡帳單尚餘循環掛帳金額為3,000元，之後2/19刷卡消費2,000元，該筆消費款銀行入帳日為2/20。小蓮3月份帳單顯示應繳總金額為5,000元，最低應繳金額1,000元。（以年息15％為例計算，個案則因各別利率而異之）<br>
                                    <strong>【假設1】</strong><br>
                                    3/18繳款截止日，收到小蓮繳納最低應繳金額1,000元，則4/3結帳日，應付上月循環信用利息為61元。因已於繳款截止日收到小蓮繳納最低應繳金額，不計收違約金。<br>
                                    《循環信用利息計算說明》 ($3,000-$1,000)×14天 (3/4-3/17) ×15%÷365＋$2,000×26天(2/20-3/17)×15%÷365＋$4,000×17天 (3/18-4/3) ×15%÷365＝$11.51＋$21.37＋$27.95＝$61元<br>
                                    《循環信用利息圖示說明》
                                    <img src="@/assets/images/terms_img.gif" class="img-fluid" alt="" /><br>
                                    <strong>【假設2】</strong><br>
                                    承上例，若於3/18繳款截止日，未收到小蓮繳款，則4/3結帳日，應付上月循環信用利息為：3,000×31天(3/4-4/3)×15%÷365＋$2,000×43天(2/20-4/3)×15%÷365＝74元。因未於繳款截止日收到繳款金額，尚有消費款5,000元未償付，未繳金額在新臺幣1,000元以上且為逾一期，故4/3結帳日計收違約金300元。
                                </p>
                            </div>
                        </div>
                        <div class="cjk-ideographic">
                            二、卡片使用
                            <div class="level-two">
                                <p>(一)
                                    持卡人之信用卡屬於本行之財產，持卡人應妥善保管及使用信用卡。本行僅授權正卡持卡人或附卡持卡人本人在信用卡有效期限內分別使用，不得讓與、轉借、提供擔保或以其他方法將信用卡之占有轉讓予第三人或交其使用。</p>
                                <p>(二) 申請人收到信用卡後，應立即在信用卡上簽名，以降低遭第三人冒用之可能性。</p>
                                <p>(三) 持卡人簽帳消費時，帳單上之簽名應與信用卡簽名欄上之簽名相同，且不得以簽名不同為由拒絕付款。如經本行同意特定金額下之免簽名交易，於消費時得不簽名。</p>
                                <p class="red">(四)
                                    持卡人於國內原須以簽名方式結帳之交易，倘消費金額於新臺幣3,000元以下者，部分之美食街、電影院、大賣場或加油站等特約商店得以免簽名方式結帳。惟實際各特約商店得以免簽名方式結帳之金額仍應依信用卡國際組織規範、各特約商店與收單機構間之約定為準。</p>
                                <p>(五) 如持卡人對免簽名交易之帳款有疑慮者，經本行調查認定非屬持卡人本人所為交易，且持卡人亦未違反 信用卡約定條款者，持卡人免負付款之責。</p>
                                <p>(六) 信用卡正、附卡為一體關係，正卡掛失或經停止使用時，附卡亦應停止使用。</p>
                            </div>
                        </div>
                        <div class="cjk-ideographic">
                            三、調閱簽帳單
                            <br>
                            持卡人於當期繳款截止日前，如對帳單所載之交易明細有疑義，得檢具理由及發卡機構要求之證明文件（如簽帳單或退款單收執聯等）通知發卡機構協助處理，或同意負擔調單手續費（國內外交易每筆新臺幣100元）後，請發卡機構向收單機構調閱簽帳單或退款單。持卡人請求發卡機構向收單機構調閱簽帳單或退款單時，約定由持卡人給付調單手續費者，如調查結果發現持卡人確係遭人盜刷或帳款疑義非可歸責於持卡人之事由時，其調閱簽帳單手續費由發卡機構負擔。如持卡人主張暫停支付時，於其同意依各信用卡國際組織作業規定繳付帳款 疑義處理費用後，得請發卡機構向收單機構或辦理預借現金機構進行扣款、信用卡國際組織仲裁等主張，並得就該筆交易對發卡機構提出暫停付款之要求。因發生疑義而暫停付款之帳款，如持卡人不同意繳付前項帳款疑義處理費用或經發卡機構證明無誤或因非可歸責於發卡機構之事由而不得扣款時，持卡人於受發卡機構通知後應立即繳付之，並自原繳款期限之次日起，以持卡人適用之信用卡 循環利率計付利息予發卡機構。
                        </div>
                        <div class="cjk-ideographic red">
                            四、卡片遺失、被竊或其他喪失、占有
                            <div class="level-two">
                                <p>(一) 持卡人之信用卡如有遺失、被竊、被搶、詐取或其他遭持卡人以外之第三人占有之情形（ 以下簡稱遺失或被竊等情形），應儘速以電話或其他方式通知本行或其他經本行指定機構辦理掛失停用手續，並繳交掛失手續費每卡新臺幣200元。惟如本行認有必要時，應於受理掛失手續日起十日內通知持卡人，要求於受通知日起三日內向當地警察機關報案或以書面補行通知本行，持卡人應依本行要求辦理，方始完成掛失停用手續。</p>
                                <p>
                                    (二) 持卡人自辦理掛失停用手續時起被冒用所發生之損失，概由本行負擔。但有下列情形之一者，持卡人仍應負擔辦理掛失停用手續後被冒用之損失：
                                    <ol>
                                        <li>第三人之冒用為持卡人容許或故意將信用卡交其使用者。</li>
                                        <li>持卡人因故意或重大過失將使用自動化設備辦理預借現金或進行其他交易之交易密碼或其他辨識持卡人同 一性之方式使第三人知悉者。</li>
                                        <li>持卡人與第三人或特約商店偽造虛構不實交易行為或共謀詐欺者。</li>
                                    </ol>
                                </p>
                                <p>
                                    (三) 辦理掛失手續前持卡人被冒用之自負額以新臺幣3000元為上限。但有下列情形之一者，持卡人免負擔自負額：
                                    <ol>
                                        <li>持卡人於辦理信用卡掛失手續時起前二十四小時內被冒用者。</li>
                                        <li>冒用者在簽單上之簽名，以肉眼即可辨識與持卡人之簽名顯不相同或以善良管理人之注意而可辨識與持卡人之簽名不相同者。 </li>
                                        <li>冒用者於本行同意辦理特定金額內免簽名之特定商店進行免簽名交易，且確認非持卡人本人之交易且非持卡人串謀之交易者。</li>
                                    </ol>
                                </p>
                                <p class="red">
                                    (四) 持卡人有本條第〈二〉項但書及下列情形之一者，且本行能證明已盡善良管理人之注意義務者，其被冒 用之自負額不適用前項約定：
                                    <ol>
                                        <li>持卡人得知信用卡遺失或被竊等情形而怠於立即通知本行，或持卡人發生信用卡遺失或被竊等情形後，自當期繳款截止日起已逾二十日仍未通知本行者。</li>
                                        <li>持卡人違反約定條款第八條第〈一〉項約定，未於信用卡簽名致第三人冒用者。</li>
                                        <li>持卡人於辦理信用卡掛失手續後，未提出本行所請求之文件、拒絕協助調查或其他違反誠信原則之行為。</li>
                                    </ol>
                                </p>
                                <p>(五) 持卡人在自動化設備辦理預借現金及其他必須以交易密碼進行交易部份，對於辦妥掛失停用手續前被冒用所發生之損失，悉由持卡人負擔，不適用本條第〈三〉項自負額之約定。
                                </p>
                            </div>
                        </div>
                        <div class="cjk-ideographic">五、持卡人以信用卡辦理預借現金時，須依本行及辦理預借現金之機構有關規定及程序辦理，並應繳付本行依 每筆預借現金金額<span class="red">3.5%+新臺幣＄100元計算之手續費（元以下四捨五入）</span>。持卡人得隨時申請開啟或要求停止使用預借現金功能。申請開啟者，本行得隨時視持卡人之信用狀況審核是否同意抑或調整預借現金之額度。</div>
                        <div class="cjk-ideographic">
                            六、信用額度
                            <div class="level-two">
                                <p>(一) 持卡人得隨時申請開啟或要求停止使用預借現金功能。申請開啟者，本行得隨時視持卡人之信用狀況審核是否同意抑或調整預借現金之額度。持卡人如不同意者，得通知本行終止本契約。</p>
                                <p>(二) 持卡人申請二張以上信用卡（含附卡），仍共用原有信用額度，附卡額度不得高於正卡。持卡人除有約定條款第八條第四項第五款但書所定情形外，不得超過本行核給之信用額度使用信用卡。但持卡人對超過信用額度使用之帳款仍負清償責任。</p>
                            </div>
                        </div>
                        <div class="cjk-ideographic red">
                            七、其他手續費
                            <div class="level-two">
                                <p>(一) 如持卡人以支票付款而未能兌現時，本行每張得加收新臺幣$300元手續費。</p>
                                <p>(二) 如因可歸責於持卡人之事由致持卡人要求補送帳單次數超逾2次或補寄自當月起算三個月(含)以上之帳單， 本行每份得酌收新臺幣$100元手續費。</p>
                                <p>(三) 本契約終止後，持卡人如已清償全部債務，得請求本行開立清償證明，每次酌收新臺幣$300元手續費。</p>
                                <p>(四) 持卡人信用卡帳款如有溢繳，得通知本行以匯款方式退款，如要求匯入本行帳戶者，本行得自退回金額中收取新臺幣$100之手續費；如匯入其他金融機構帳戶者，本行得自退回金額中收取新臺幣$130之手續費。
                                </p>
                            </div>
                        </div>
                        <div class="cjk-ideographic">
                            八、分期消費暨相關消費權益所謂信用卡分期付款交易係由本行一次墊付消費款項全額予特約商店，再由持卡人分期支付消費帳款予本行。進行郵購買賣或訪問買賣交易時，可依消費者保護法第十九條規定向特約商店解除買賣契約。
                        </div>
                        <div class="cjk-ideographic">
                            九、學生及未成年人持卡注意事項
                            <div class="level-two">
                                <p>(一) 學生或未成年人在使用信用卡時，應先詳閱信用卡約定條款以了解雙方權利義務，並了解使用循環信用 與預借現金將容易擴張信用。</p>
                                <p>(二) 二十至二十四歲之持卡人，如於申請之時未填載為學生身分或尚非學生者，嗣後本行如經由其他管道或接獲家長反映其子女為具有學生身分之正卡持卡人，且有超出清償能力刷卡情形時，本行應立即配合持卡人家長處理，並應於財團法人金融聯合徵信中心登錄其學生身分。
                                </p>
                                <p>(三) 學生或未成年人在使用信用卡時，應該先向父母告知溝通，並藉由信用卡的使用，讓自己學習自主理財的負責態度。本行得因學生及未成年人之父母親（法定代理人）要求，無須事先通知或催告，停止持卡人使用信用卡之權利。
                                </p>
                                <p>(四) 以學生身分申請信用卡者，本行會將發卡情事通知其父母或法定代理人。</p>
                            </div>
                        </div>
                        <div class="cjk-ideographic">
                            十、停卡記錄<br>
                            持卡人如因繳款情形不良而遭本行依信用卡約定條款之約定強制停止持卡人使用信用卡之權利，該強制停卡紀錄將儲存於財團法人金融聯合徵信中心資料庫，並自持卡人清償之日起揭露六個月。
                        </div>
                        <div class="cjk-ideographic-two red">
                            十一、權益變更通知<br>
                            會員使用手冊所列之會員權益，如有變更或取消增加持卡人之可能負擔時，本行將於六十日前以書面或簡訊或其他電子文件通知持卡人。如持卡人於異議期限內，表示異議，並因而終止契約者，本行對於使用循環信用方式或分期付款方式繳款之持卡人，應給予至少六期之緩衝期，但原分期付款剩餘期數小於六期者，依原契約繼續履行。
                        </div>
                        <div class="cjk-ideographic-two red">
                            十二、本行向持卡人收取之年費、各項手續費、循環信用利率、循環信用利息及違約金等之計算方式、可能負擔之一切費用暨本行提供持卡人之各項權益、優惠或服務之期間及適用條件，每季評估調整乙次。
                        </div>
                        <div class="cjk-ideographic-two red">
                            十三、現金回饋卡別之刷卡簽帳金額，不納入信用卡典藏紅利回饋系統。持卡人持卡片表面無凸字卡號之信用卡〈如wave卡、mini卡等〉或轉帳卡或電子票證，如特約商店以人工手動壓印卡面凸字方式進行刷卡交易時，上述卡片因無法拓印出卡號，將無法進行交易。另聯邦VISA
                            MINI卡、旅遊卡小卡亦不得於自動化服務設備(ATM) 及需完整卡片尺寸之刷卡機上或在飛機上進行交易及預借現金。</div>
                        <div class="cjk-ideographic-two red  mb-4">十四、上述條款若有未盡事宜，適用本行信用卡約定條款（約定條款將與卡片一併以掛號郵寄持卡人）之規定。
                        </div>
                    </div>
                </div>
                <br>
                <br>
                <div class="txt">
                    <h3>申請說明</h3>
                    <p><span class="red">親愛的客戶您好，由於個人資料之蒐集涉及您的隱私權益，請於申請前詳閱以下說明並事先於聯邦銀行信用卡網站查詢信用卡約定條款及相關收費方式與各項權益介紹，以確保您的權益。</span>■聯邦商業銀行股份有限公司(以下稱本行)為向您蒐集個人資料並為利用與處理，依據個人資料保護法(以下稱個資法)第八條規定應告知下列事項：
                    </p>
                    <ul class="aul">
                        <li>蒐集之目的：本行將在「022外匯業務、036存款與匯款業務、040行銷業務、059金融服務業依法令規定及金融監理需要所為之蒐集處理及利用、060金融爭議處理、063非公務機關依法定義務所進行個人資料之蒐集處理及利用、067信用卡現金卡轉帳卡或電子票證業務、069其他契約類似契約或法律關係管理之事務或業務、082借款戶與存款戶存借作業綜合管理、088核貸與授信業務、090消費者客戶管理與服務、091消費者保護、098商業與技術資訊、104帳務管理及債權交易業務、106授信業務、111票券業務、112票據交換業務、113陳情、請願、檢舉案件處理、135資(通)訊服務、136資(通)訊與資料庫管理、137資通安全與管理、154徵信、157調查、統計與研究分析、181其他經營合於營業登記項目或組織章程所定之業務（例如：電子金融業務、代理收付業務、共同行銷或合作推廣業務…）、182其他諮詢與顧問服務、依照FATCA法案及IGA協議辨識身分並提供予國內外主管機關」之範圍內蒐集、處理、利用您的個人資料。
                        </li>
                        <li>個人資料之類別：中、英文姓名、身分證統一編號、美國稅籍編號、性別、出生年月日、出生地、國籍、聯絡電話號碼、戶籍地址、住址、工作地址、電子郵遞地址、帳戶號碼與戶名、電子發票號碼、儲蓄、結匯紀錄、財務交易、帳戶餘額、帳戶總交易金額、交易明細、IP位址、Cookie ID與其內容、網域名稱、裝置資訊、行動裝置識別碼、社群網路資訊、網際網路瀏覽/點選軌跡等及如申請書所示之客戶基本資料欄位及所檢附個人財務資料文件等內容，並以本行與客戶往來之相關業務、帳戶或服務及自您或第三人處（如財團法人金融聯合徵信中心等）所實際蒐集之個人資料為準。
                        </li>
                        <li>資料利用之期間：申請人依特定目的存續期間與國內外相關法令所定（如商業會計法等）或因執行業務所必須之保存期間（自申請日至契約中止後15年間）或信用卡契約約定之期間之保存年限，並以期限最長者為準。
                        </li>
                        <li>資料利用之地區：台灣地區與使用服務地域並包含以下利用對象之國內外所在地。</li>
                        <li>資料利用之對象：本行及海內外分支機構(含受本行委託處理事務之委外機構)、其他業務相關機關(如通匯行、財團法人聯合信用卡處理中心、財團法人金融聯合徵信中心、信用卡國際組織、台灣票據交換所、財金資訊股份有限公司、信用保證機構、收單機構暨特約商店等)、國內外依法有權機關或金融監理機關及您所同意之對象（包含本行共同行銷單位(詳見本行網站)或本行合作推廣業務之單位，如:連加網路商業股份有限公司）。
                        </li>
                        <li>資料利用之方式：符合個資法相關法令以自動化機器或其他非自動化之利用方式。</li>
                        <li>依據個資法第三條所訂您就本行保有您的個人資料得行使下列權利，有關如何行使之方式，得向本行客服詢問或於本行網站查詢：1.除有個資法第十條所規定之例外情形外，得向本行查詢、請求閱覽或請求製給複製本，惟本行依個資法第十四條規定得酌收必要成本費用。2.得向本行請求補充或更正，惟依個資法施行細則第十九條規定，應適當釋明其原因及事實。3.本行如有違反個資法規定蒐集、處理或利用您之個人資料，依個資法第十一條第四項規定，得向本行請求停止蒐集。4.依個資法第十一條第二項規定，個人資料正確性有爭議者，得向本行請求停止處理或利用您之個人資料。惟依該項但書規定，本行因執行業務所必須並註明其爭議或經您書面同意者，不在此限。5.依個資法第十一條第三項規定，個人資料蒐集之特定目的消失或期限屆滿時，得向本行請求刪除、停止處理或利用您之個人資料。惟依該項但書規定，本行因執行業務所必須或經您書面同意者，不在此限。
                        </li>
                        <li>您得自由選擇是否提供上開個人資料及類別，惟如拒絕提供之資料為審核或作業所需之資料，本行可能無法進行必要之業務審核或作業而無法提供您相關服務或無法提供較佳之服務，敬請見諒。
                        </li>
                    </ul>
                    <div class="text-right mt-4">111.07</div>
                </div>
            </div>
            <div id="button_terms" class="button_terms">
                <input ref="button_termsOpt_1" type="checkbox" id="button_termsOpt_1" v-model="agreement" value="agree1" disabled="" />
                <label id="read_1" for="button_termsOpt_1">我已詳細閱讀。(請勾選)</label>
            </div>
            <!----------------//1-------------------------------------------->

            <!------------------2-------------------------------------------->
            <div ref="termBox2" id="terms_box_2" class="terms_box">
                <!--uc1:wuc重要告知事項 runat="server" id="wuc重要告知事項" /-->
                <div class="txt">
                    <h3>重要告知事項</h3>
                    <div>
                        一、提供之證明文件及申請書上所載各項資料均正確無誤，以作為徵審之依據，同意貴行、貴行委託之第三人、往來之金融機構、財團法人金融聯合徵信中心、財團法人聯合信用卡處理中心、財金資訊股份有限公司、信用卡國際組織或其他經本人同意之單位及主管機關指定之機構得基於特定目的或其他法令許可範圍內隨時查詢、蒐集、處理、國際傳遞及利用本人及附卡相關資料，並授權貴行利用本人及附卡申請人於貴行留存各項資料（包含信託及證券交易往來資料）及同意由貴行依法令規定，判斷上述特定目的是否消失。受貴行委任處理事務之第三人，依法令規定而有繼續保存資料之必要時，於貴行及第三人仍願續負保守秘密義務之前提下，本人及附卡申請人同意貴行及第三人繼續保留相關資料。
                    </div>
                    <div>
                        二、為向貴行申請信用卡，本人同意依所勾選或附加之一卡通、悠遊卡儲值功能，履行信用卡約定條款、一卡通特別約定條款、悠遊卡特別約定條款及各項專案所定注意事項，並知悉約定條款將與信用卡同時寄送，如對約定條款有異議時應於七日內將卡片剪斷寄回，否則視為本人允諾該約定條款，本人於七日內亦得不附理由及負擔費用通知解除契約，惟已用卡者不在此限。
                    </div>
                    <div>三、貴行主動調高信用卡信用額度前，將先徵得本人書面同意。惟本人如已持有貴行信用卡，再向貴行申請其他信用卡者，新卡申請書視為調高額度之申請，貴行得隨同調高原信用卡之信用額度。
                    </div>
                    <div>四、貴行保留發卡與否之權利，且就本申請書及所附相關證明文件將不予退還，一經貴行核發卡片後，不論是否動用額度，相關紀錄均會登載於財團法人金融聯合徵信中心。</div>
                    <div>
                        五、本人申請書上填載為學生身分，貴行會將發卡情事通知本人父母或法定代理人，請其注意本人使用信用卡情形。貴行如發現未據實告知學生身分者，將依前段約定辦理，且只持有超過3家及每家信用額度已超過新台幣2萬元之情事，貴行將立即通知停止本人卡片的使用。
                    </div>
                    <div>六、本人於貴行歸戶後帳戶如有符合美國海外帳戶稅收遵從法案申報條件，經貴行通知後不同意申報或無法取得連繫，貴行將停止信用卡使用。</div>
                    <div class="red">七、本人同意為保障本人交易安全及貴行權益，於貴行認為必要時，得於通知本人後進行卡片控管，如無法即時通知，亦得先行控卡再補通知。</div>
                    <div class="red">八、核卡後，貴行不立即提供預借現金服務，將依本人信用狀況予以開放此功能，同時貴行一律不主動寄發預借現金密碼函，申請密碼專線(02)2545-5168 (07)226-9393按3再按2。</div>
                    <div>九、本人如需超過貴行原核給信用額度使用卡片時，需事先徵得貴行同意或超過部份以現金補足。另經<span class="red">貴行考量本人之信用及往來狀況亦得特別授權特約商店接受本人使用信用卡交易，且超過信用額度使用之帳款本人仍將負清償責任，並納入當期最低應繳款項。</span>
                    </div>
                    <div>十、本人同意貴行得依電子簽章法規定經由貴行服務專線或電子服務為本人辦理信用卡相關產品及服務，並同意電話語音及電磁紀錄得為電子文件表示方式，且得作為書面同意之依據。</div>
                    <div>十一、本申請書上記載之權益、優惠及異業結盟業者提供優惠權益之期間，除各優惠活動另有記載外，其餘均至<span class="red">民國111年12月31日止</span>，其詳細內容限制依權益手冊記載者為依據。嗣後期間如有延長或權益、優惠內容有異動，將於聯邦銀行信用卡網站公告，<span class="red">如因信用卡商品或服務所生爭議得來電本行客服中心（02）2545-5168（07）226-9393。</span></div>
                    <div class="red">十二、本人同意信用卡契約之相關通知，包含信用卡約定條款、卡友權益手冊、電子票證特別約定條款等，約定貴行得以電子郵件、手機簡訊、QR code或其他電子文件方式寄送或通知本人審閱，如日後相關條款或權益變更時亦同。如本人欲以紙本寄送到本人於貴行最後留存之地址，本人將致電通知貴行客服。</div>
                    <div>十三、本人同意倘賴點卡之刷卡消費有取消、退貨或帳務調整等事情，將自LINE帳號扣回原先已贈送之LINE POINTS點數。如持卡人已有使用該等LINE POINTS點數折抵或兌換導致無法扣回，且LINE POINTS點數負點持續2個月以上，本行得以1點等同於新台幣1元之比例，將不足點數之約當金額，列示為信用卡帳單之應繳金額向持卡人收取。相關規定悉依貴行最新公告為準。</div>
                    <div>十四、申請人同意 貴行基於回饋與服務卡友之立場，核發卡別可獲得聯邦銀行提供之消費回饋為連加網路商業股份有限公司LINE Biz+ Taiwan Ltd.(以]下簡稱LINE Pay)之LINE POINTS點數，並得將申請人基本資料、往來交易資料等提供與LINE Pay，作為消費回饋處理、資料串接、訊息通知及點數發放等相關目的範圍內使用。</div>
                    <div>十五、本人同意一旦喪失安麗日用品股份有限公司員工、會員、直銷商會員資格、或本人眷屬喪失前述資格者，貴行得停止本張卡片的使用權利並得換發貴行其他信用卡供本人使用。</div>
                    <div>十六、如申請人擬以本張正卡，申請自動扣款安麗日用品股份有限公司之年度續約費，敬請向安麗公司全省服務中心櫃台人員，安麗顧客服務組（02）2175-5166或安麗儲運中心訂貨組（02）2175-5168 索取「年度續約費授權書」作申請事宜。</div>
                    <div class="red">
                        ※本人確認業經合理期間詳細審閱並完全了解貴行依個人資料保護法第八條所進行之告知內容及本申請書所列信用卡相關利率、費用項目及收取標準(詳如信用卡利率/費用一覽表)，並就上述聲明事項、正反面所載有關申請聯邦銀行信用卡用卡須知及重要約定事項之內容，同意提供個人資料予貴行及遵守信用卡約定條款之規定，茲簽名如下以示負責。【附卡申請人同意貴行將約定條款或其他業務上應為之通知（如帳單等)，向正卡申請人送達即對附卡申請人發生相同之效力。】
                    </div>
                    <div class="red">※申請悠遊聯名卡者同意卡片已開啟自動加值功能。□不同意開啟。</div>
                    <div class="red">※申請一卡通聯名卡者同意卡片已開啟自動加值功能。(AUTOLOAD)</div>
                    <div class="red">※申請聯邦微風聯名卡包括成為Breeze Rewards微風積點禮遇會員。</div>
                    <div>
                        <table width="100%" class="table-bordered">
                            <tbody>
                                <tr>
                                    <td width="20%" align="center"><strong>項 目</strong></td>
                                    <td colspan="2" align="center"><strong>金 額</strong></td>
                                </tr>
                                <tr>
                                    <td align="center">循環信用利息</td>
                                    <td colspan="2" align="center"><span class="red">5%~15%</span></td>
                                </tr>
                                <tr>
                                    <td rowspan="4" align="center">遲延繳款違約金</td>
                                    <td align="center">逾期期數</td>
                                    <td align="center">違約金金額</td>
                                </tr>
                                <tr>
                                    <td align="center">第一期</td>
                                    <td align="center"><span class="red">300元</span></td>
                                </tr>
                                <tr>
                                    <td align="center">連續第二期</td>
                                    <td align="center"><span class="red">400元</span></td>
                                </tr>
                                <tr>
                                    <td align="center">連續第二期</td>
                                    <td align="center"><span class="red">500元</span></td>
                                </tr>
                                <tr>
                                    <td align="center">年 費</td>
                                    <td colspan="2"><span class="red">卡友享第一年免年費，第二年起依據每張卡片年費到期日往前推算一年，檢核同一身分證字號下之消費，若不符合標準則以單卡按以下標準 計算收取年費：年消費1萬元(含)以上或消費10次(含)以上則免收取年費；年消費5,000元(含)或5次(含)以上收取年費500元；年消費未達 5,000元或5次收取年費1,000元，不分正、附卡與白金、金及普卡。理財型白金卡正卡5,000元，白金卡等級以上其他卡別詳網站信用卡家族公告。※每一卡別所提供之年費減免或折價優惠，每一持卡人僅得享有一次優惠，若於年費優惠期間截止前將卡片停用後又重新申請者，恕不再享有優惠。</span>
                                    </td>
                                </tr>
                                <tr>
                                    <td align="center">帳單補寄費</td>
                                    <td colspan="2"><span class="red">如因可歸責於持卡人之事由致每期補送(含當期)帳單次數超逾2次者，或補寄超過二個帳款期間以前之帳單，本行得按次或按每帳款期間收取新臺幣100元之補發帳單手續費。</span></td>
                                </tr>
                                <tr>
                                    <td align="center">預借現金</td>
                                    <td colspan="2"><span class="red">預借金額×3.5%+100元</span></td>
                                </tr>
                                <tr>
                                    <td align="center">退回溢繳款手續費</td>
                                    <td colspan="2"><span class="red">以匯款方式退款，匯入本行帳號，每次自退回金額中扣除100元手續費；匯入非本行帳號，每次自退回金額中扣除130元手續費。</span></td>
                                </tr>
                                <tr>
                                    <td align="center">語音/網路代繳各類費用<br>
                                        及稅款手續費</td>
                                    <td colspan="2"><span class="red">交通罰鍰，換發行照規費每筆20元，其餘每筆收0.35％(不足30元以30元計算)</span></td>
                                </tr>
                                <tr>
                                    <td align="center">國外交易手續費</td>
                                    <td colspan="2"><span class="red">以應向各信用卡國際組織給付之交易手續費及本行以交易金額百分之0.5計算之國外交易服務費結付(元以下四捨五入)</span></td>
                                </tr>
                                <tr>
                                    <td align="center">一卡通聯名卡相關費用</td>
                                    <td colspan="2"><span class="red">未開卡自動加值達三次者收取帳務處理費500元、交易紀錄查詢手續費：第一頁20元，第二頁起每頁加收5元。</span>
                                    </td>
                                </tr>
                                <tr>
                                    <td align="center">悠遊卡聯名卡相關費用</td>
                                    <td colspan="2"><span class="red">轉卡手續費：50元/卡；終止契約作業手續費：20元/卡。交易紀錄查詢手續費：第一頁20元，第二頁起每頁加收5元。</span>
                                    </td>
                                </tr>
                                <tr>
                                    <td align="center">電子化繳費稅處理平台</td>
                                    <td colspan="2"><span class="red">◎於111年12月31日前免收手續費(不含罰單) ◎政府規費之罰單手續費：3元/筆。(本平台完整繳費項目及手續費詳見聯邦信用卡網站，實際適用通路、罰單類交易之判定及手續費金額依財金資訊股份有限公司或各繳費機構現場公告為準。)</span></td>
                                </tr>
                                <tr>
                                    <td align="center">調閱簽單手續費</td>
                                    <td colspan="2"><span class="red">100/筆</span></td>
                                </tr>
                                <tr>
                                    <td align="center">支票付款未能兌現手續費</td>
                                    <td colspan="2"><span class="red">300/元</span></td>
                                </tr>
                                <tr>
                                    <td align="center">車輛選號/標號牌費</td>
                                    <td colspan="2"><span class="red">50元/筆</span></td>
                                </tr>
                                <tr>
                                    <td align="center">信用卡於公務機關<br>
                                        臨櫃繳納各項費用</td>
                                    <td colspan="2"><span class="red">最高35元/筆</span></td>
                                </tr>
                                <tr>
                                    <td align="center">掛失費</td>
                                    <td colspan="2"><span class="red">200元/卡</span></td>
                                </tr>
                                <tr>
                                    <td align="center">中華電信費用</td>
                                    <td colspan="2"><span class="red">10元/筆</span></td>
                                </tr>
                                <tr>
                                    <td align="center">開立清償證明之手續費</td>
                                    <td colspan="2"><span class="red">300元/次</span></td>
                                </tr>
                                <tr>
                                    <td align="center">電子化政府付費平台</td>
                                    <td colspan="2"><span class="red">20元/筆</span></td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
            </div>
            <div id="button_terms_2" class="button_terms">
                <input ref="button_termsOpt_2" type="checkbox" id="button_termsOpt_2" v-model="agreement" value="agree2" disabled="" />
                <label id="read_2" for="button_termsOpt_2">我已詳細閱讀。(請勾選)</label>
            </div>
            <!----------------//2-------------------------------------------->

            <!------------------3-------------------------------------------->
            <div ref="termBox3" id="terms_box_3" class="terms_box">
                <!--uc1:wuc聯邦信用卡約定條款 runat="server" id="wuc聯邦信用卡約定條款" /-->
                <!--uc1:wuc悠遊聯名卡特別約定條款 runat="server" id="wuc悠遊聯名卡特別約定條款" Visible="false" /-->
                <!--uc1:wuc一卡通聯名卡特別約定條款 runat="server" id="wuc一卡通聯名卡特別約定條款" Visible="false" /-->
                <div class="txt">
                    <h3>聯邦信用卡約定條款</h3>
                    <p>
                        申請人與聯邦商業銀行股份有限公司(以下簡稱發卡機構)間因申請持用信用卡事宜，雙方約定並願遵守下列條款：<br>
                        <span class="red">本契約之審閱期間為七日，自申請人接獲本契約之翌日起算。申請人如未於審閱期間內表示異議或於審閱期間內使用新核發之信用卡，視為申請人同意本契約。</span>
                    </p>
                    <div>
                        第一條（定義）
                        <div class="l-two-em">
                            本契約所用名詞定義如下：
                            <p>一、「持卡人」：指經發卡機構同意並核發信用卡之人，且無其他特別約定時，包含正卡及附卡持卡人。</p>
                            <p>二、「收單機構」：指經各信用卡組織授權辦理特約商店簽約事宜，並於特約商店請款時，先行墊付持卡人交易帳款予特約商店之機構。</p>
                            <p>三、「特約商店」：指與收單機構簽訂特約商店契約，並依該契約接受信用卡交易之商店，且無其他特別約定時，包含辦理預借現金之機構。</p>
                            <p>四、「信用額度」：指如無其他特別約定時，係指發卡機構依持卡人之財務收入狀況、職業、職務或與金融機構往來紀錄等信用資料，核給持卡人累計使用信用卡所生帳款之最高限額。</p>
                            <p>五、「應付帳款」：指如無其他特別約定時，係指當期及前期累計未繳信用卡消費全部款項、預借現金金額，加上循環信用利息、年費、違約金、預借現金手續費、掛失手續費或調閱簽帳單手續費等其他應繳款項。
                            </p>
                            <p><span class="red">六、「得計入循環信用本金之帳款」：指依第十四條第四項或第十五條第二項計算循環信用時，自各筆帳款入帳日起至全部應付帳款結清之日止，所有入帳之每筆信用卡消費款項與預借現金金額之未清償部分，但不包含當期消費帳款、當期預借現金金額、循環信用利息、年費、違約金、預借現金手續費、掛失手續費或調閱簽帳單手續費等費用。</span>
                            </p>
                            <p>七、「入帳日」：指發卡機構代持卡人給付款項予收單機構或特約商店或為持卡人負擔墊款義務，並登錄於持卡人帳上之日。</p>
                            <p>八、「結匯日」：係指持卡人於國外持卡消費後，由發卡機構或發卡機構授權之代理人依各信用卡組織按約所列匯率，將持卡人之外幣應付帳款折算為新臺幣或約定外幣結付之日。</p>
                            <p>九、「結帳日」：係指發卡機構按期結算持卡人應付帳款之截止日。超過結帳日後始入帳之應付帳款列入次期計算之。</p>
                            <p>十、「繳款截止日」：指持卡人每期繳納應付帳款最後期限之日。</p>
                            <p><span class="red">十一、「帳單」：指發卡機構交付持卡人之交易明細暨繳款通知書。</span></p>
                        </div>
                    </div>
                    <div>
                        第二條（申請）
                        <div class="l-two-em">
                            信用卡申請人應將個人、財務資料及其他相關資料據實填載於申請表格各欄，並依發卡機構要求提出真實及正確之有關資料或證明文件。<br>
                            持卡人留存於發卡機構之資料有所變動時，應立即通知發卡機構。
                            <span class="red">未依規定辦理致生任何延誤或損失時由持卡人負責，與發卡機構無涉。</span><br>
                            <span class="red">發卡機構得要求信用卡申請人提供保證人，作為核准其申請信用卡之條件。保證人應於持卡人就使用信用卡所生之全部應付帳款，於持卡人無力清償或拒絕清償時，負保證責任。保證人就持卡人依本約定條款所應負之責任，亦應負同一責任。</span>
                        </div>
                    </div>
                    <div>
                        第三條（附卡持卡人）
                        <div class="l-two-em">
                            正卡持卡人得經發卡機構同意為第三人申請核發附卡。正卡持卡人就其本人與附卡持卡人使用信用卡所生應付帳款之全部負清償責任。<br>
                            如正卡持卡人未依前項規定清償時，
                            <span class="red">附卡持卡人僅就使用該附卡所生應付帳款負清償責任。</span><br>
                            <span class="red">有關本約定條款、帳單或其他與信用卡有關之一切文書或通知，經送達正卡持卡人時，視同亦已送達附卡持卡人。</span><br>
                            <span class="red">附卡持卡人得透過發卡機構客服專線，查詢附卡持卡人之消費明細及清償責任之金額。</span><br>
                            <span class="red">正卡持卡人得隨時通知發卡機構停止或終止附卡持卡人之使用權利。</span><br>
                            <span class="red">發卡機構停止正卡持卡人使用信用卡之權利或正卡信用卡契約被終止或解除時，除另有約定外，附卡亦應隨之停止使用、契約終止或解除。</span>
                        </div>
                    </div>
                    <div>
                        第四條（個人資料之蒐集、處理及利用）
                        <div class="l-two-em">
                            發卡機構僅得於信用卡申請或履行契約之目的範圍內，蒐集、處理、利用及國際傳輸信用卡申請人或持卡人(含保證人)之個人資料及與金融機構之往來資料。但相關法規另有規定或契約另有約定者，不在此限。<br>
                            基於前項之特定目的範圍內，信用卡申請人或持卡人(含保證人)同意發卡機構得將信用卡申請人或持卡人(含保證人)之個人資料及與發卡機構之往來資料(以下簡稱個人資料)提供予持卡人往來之金融機構、財團法人聯合信用卡處理中心、財金資訊股份有限公司、信用卡國際組織、財團法人金融聯合徵信中心
                            <span class="red">及其他經信用卡申請人或持卡人(含保證人)同意之單位。</span><br>
                            受發卡機構遵循相關法令委任代為處理事務之人及前項信用卡申請人或持卡人(含保證人)同意之對象等第三人，亦得隨時於相關法令所允許之範圍內，蒐集、處理、利用及國際傳輸個人資料。但發卡機構提供予前述機構之信用卡申請人或持卡人(含保證人)之個人資料如有錯誤或變更時，發卡機構應主動適時更正或補充，並要求前述機構更正或補充，及通知信用卡申請人或持卡人(含保證人)。
                            <br>
                            受發卡機構遵循相關法令委任代為處理事務之人違反個人資料保護法規定，致個人資料遭不法蒐集、處理、利用或其他侵害信用卡申請人或持卡人(含保證人)權利者，信用卡申請人或持卡人(含保證人)得依民法、個人資料保護法或其他相關法規規定，向發卡機構及受發卡機構遵循相關法令委任代為處理事務之人請求連帶賠償。
                            <br>
                            信用卡申請人或持卡人(含保證人)提供發卡機構之相關資料，如遭發卡機構以外之機構或人員竊取、洩漏、竄改或其他侵害者，應儘速以適當方式通知信用卡申請人或持卡人(含保證人)，且信用卡申請人或持卡人(含保證人)向發卡機構要求提供相關資料流向情形時，發卡機構應即提供信用卡申請人或持卡人(含保證人)該等資料流向之機構或人員名單。
                            <br>
                            <span class="red">信用卡核卡後，銀行將依主管機關規範將信用卡核卡、卡片使用狀態、繳款紀錄等，報送登錄財團法人金融聯合徵信中心，如持卡人未依約繳款，報送之信用不良紀錄，可能影響持卡人現有卡片之使用限制及未來申辦貸款〈含現金卡〉與金融機構往來之信用評估或信用卡之權益。上述信用不良紀錄之揭露期間請上聯徵中心網站〈www.jcic.org.tw〉「社會大眾專區」之「資訊揭露期間」查詢。</span>
                        </div>
                    </div>
                    <div>
                        第五條（信用額度）
                        <div class="l-two-em">
                            發卡機構得視持卡人之信用狀況核給信用額度，<span class="red">且得由發卡機構或依持卡人之申請調整，並以書面通知持卡人。持卡人如不同意者，得通知發卡機構終止本契約。發卡機構如調高持卡人信用額度，</span>應事先通知正卡持卡人，並取得其書面同意後為之。<br>
                            <span class="red">發卡機構各卡別設有最低額度下限</span>，持卡人得要求發卡機構調高或降低信用額度；如調降信用額度至各卡別最低額度以上者，發卡機構不得拒絕。<span class="red">如低於發卡機構所設之下限者，持卡人同意更換卡別或接受調整至發卡機構所設之最低限額</span>。<br>
                            前項信用額度調整，若原徵有保證人者，除調高信用額度應事先通知保證人並獲其書面同意外，應於調整核准後通知保證人。<br>
                            第一項書面同意之方式，持卡人亦得透過網路認證或自動提款機或自動貸款機之方式為之。如發卡機構未確實驗證持卡人或保證人身分，應就持卡人或保證人信用額度調高所造成損失，負擔相關損失責任，<span class="red">但前揭損失係持卡人或保證人故意或重大過失致驗證身分同一性方式遭偽冒第三人知悉者，發卡機構無須負擔。</span><br><span class="red">持卡人申請二張以上信用卡(含附卡)，仍共用原有信用額度。持卡人除有第八條第四項第五款但書所定情形外，不得超過發卡機構核給之信用額度使用信用卡。但持卡人對超過信用額度使用之帳款仍負清償責任。</span>
                        </div>
                    </div>
                    <div>
                        第六條（契約雙方之基本義務）
                        <div class="l-two-em">
                            發卡機構應以<span class="red">善良管理人之注意</span>，確保持卡人於發卡機構自行訂約或由各收單機構提供之特約商店，使用信用卡而取得商品、勞務、其他利益或預借現金，並依持卡人約定之指示方式為持卡人處理使用信用卡交易款項之清償事宜。<span class="red">如經發卡機構同意減收或免收年費者，亦同</span>。<br>持卡人之信用卡屬於發卡機構之財產，<span class="red">持卡人應妥善保管及使用信用卡</span>。持卡人應親自使用信用卡，不得以任何方式將信用卡或其卡片上資料交付或授權他人使用。<br>持卡人就其開卡密碼或其他辨識持卡人同一性之方式應予以保密，不得告知第三人。<br>持卡人不得與他人或特約商店為虛偽不實交易行為或共謀詐欺，以使用信用卡方式折換現金或取得利益，<span class="red">持卡人應依誠信原則享有發卡機構所給予之信用卡使用優惠，不得違反正常交易習慣或其他故意以損害發卡機構利益之方式取得相關優惠</span>。<br>持卡人違反第二項至第四項約定致生之應付帳款者，亦應對之負清償責任。<br>發卡機構應確保廣告內容之真實，對持卡人所負之義務不得低於廣告之內容。
                        </div>
                    </div>
                    <div>
                        第七條（年費）
                        <div class="l-two-em">
                            <span class="red">信用卡申請人於發卡機構核發信用卡後，除經發卡機構同意免收或減收年費外，應於發卡機構指定期限內繳交年費（各卡年費詳見信用卡申請書及信用卡網站），且不得以第二十二條，或第二十三條第四項及第五項之事由或其他事由請求退還年費。但本條第二項、第十九條第五項及第二十一條約定之情形，不在此限。</span><br>
                            因不可歸責於持卡人之事由，致終止契約或暫停持卡人使用信用卡之權利達一個月以上者，持卡人得請求按實際持卡月數（未滿一個月者，該月不予計算）比例退還部分年費。
                            <br>
                            <span class="red">申請人於收到核發之信用卡七日內，得以書面或以信用卡截斷並寄回發卡機構方式通知發卡機構解除契約，無須說明理由及負擔任何費用或價款，但已使用核發新卡者，不在此限。</span>
                        </div>
                    </div>
                    <div>
                        第八條（一般交易及退貨等處理程序）
                        <div class="l-two-em">
                            <span class="red">申請人收到信用卡後，應立即在信用卡上簽名，以降低遭第三人冒用之可能性。</span><br>
                            持卡人使用信用卡交易時，於出示信用卡刷卡後，經查對無誤，應於簽帳單上簽名確認，並自行妥善保管簽帳單收執聯，以供查證之用。
                            <br>
                            持卡人於特約商店同意持卡人就原使用信用卡交易辦理退貨、取消交易、終止服務、變更貨品或其價格時，應向特約商店索取退款單，經查對無誤後，應於退款單上簽名確認，並自行妥善保管退款單收執聯，以供查證之用。但經持卡人及特約商店同意，得以特約商店自行簽認，並以持卡人保留之退貨憑證或其他足資證明文件之方式替代之。
                            <br>
                            <span class="red">特約商店於下列情形得拒絕接受持卡人使用信用卡交易：</span>
                            <p>一、信用卡為偽造、變造或有破損、斷裂、缺角、打洞、簽名欄為空白、簽名模糊無法辨認及簽名塗改之情事者。</p>
                            <p>二、信用卡有效期限屆至、業依第十七條第一項辦理掛失或本契約已解除或終止者。</p>
                            <p>三、發卡機構已暫停持卡人使用信用卡之權利者。</p>
                            <p>四、持卡之人在簽帳單上之簽名與信用卡上之簽名不符、持卡之人與信用卡上之照片不符，或得以其他方式證明持卡之人非發卡機構同意核發信用卡之本人者。</p>
                            <p>五、持卡人累計本次交易後，已超過發卡機構原核給信用額度者。<span class="red">但超過部分經持卡人以現金補足，或經發卡機構考量持卡人之信用及往來狀況，特別授權特約商店得接受其使用信用卡交易者，不在此限。</span>
                            </p>
                            <span class="red">前項第一款、第二款或第四款之情形者，特約商店得拒絕返還該信用卡。<br>
                                持卡人如遇有特約商店或辦理預借現金機構依第四項各款以外之事由拒絕持卡人使用信用卡交易，或以使用信用卡為由要求增加商品或服務價格者，得向發卡機構提出申訴，發卡機構應自行或於轉請收單機構查明後，將處理情形告知持卡人。如經查明就特約商店或預借現金機構上述情事，發卡機構有故意或重大過失者，應對持卡人負損害賠償責任。</span>
                        </div>
                    </div>
                    <div>
                        第九條（特殊交易）
                        <div class="l-two-em">
                            依交易習慣或交易特殊性質，其係以郵購、電話訂購、傳真、<span class="red">網際網路、行動裝置、自動販賣設備</span>等其他類似方式訂購商品、取得服務、代付費用而使用信用卡付款，或使用信用卡於自動化設備上預借現金等情形，發卡機構得以密碼、電話確認、收貨單上之簽名、郵寄憑證或其他得以辨識當事人同一性及確認持卡人意思表示之方式代之，無須使用簽帳單或當場簽名。<br>
                            <span class="red">持卡人原須以簽名方式結帳之交易，倘國內消費金額於新臺幣三千元以下或國外消費金額屬於信用卡國際組織規定之免簽名交易者，特約商店得以免簽名方式結帳。</span>
                        </div>
                    </div>
                    <div>
                        第十條（預借現金）
                        <div class="l-two-em">
                            持卡人以信用卡辦理預借現金時，須依發卡機構及辦理預借現金之機構有關規定及程序辦理，並應繳付發卡機構<span class="red">依每筆預借現金金額3.5％＋新臺幣100元計算之手續費，並得隨時清償。預借現金金額於當期繳款期限截止日前如未全部清償，發卡機構應就未清償部分依第十五條約定計收循環信用利息。</span><br>
                            持卡人不得以信用卡向未經主管機構核准或非各信用卡組織委託辦理預借現金之機構或向第三人直接或間接取得資金融通。
                            <br>
                            <span class="red">發卡機構如同意向持卡人提供預借現金服務者，持卡人得隨時申請開啟或要求停止使用預借現金功能。申請開啟者，發卡機構得隨時依持卡人之信用狀況審核是否同意或調整預借現金之額度。</span>
                        </div>
                    </div>
                    <div>
                        第十一條（暫停支付）
                        <div class="l-two-em">
                            持卡人如與特約商店就有關商品或服務之品質、數量、金額，或與委託辦理預借現金機構就取得金錢之金額有所爭議時，應向特約商店或委託辦理預借現金機構尋求解決，不得以此作為向發卡機構拒繳應付帳款之抗辯。<br>
                            <span class="red">持卡人使用信用卡時，如符合各信用卡組織作業規定之下列特殊情形：如預訂商品未獲特約商店移轉商品或其數量不符、預訂服務未獲提供，或於自動化設備上預借現金而未取得金錢或數量不符時，應先向特約商店或辦理預借現金機構尋求解決。如無法解決時，應於繳款截止日前，檢具發卡機構要求之相關證明文件</span>，請求發卡機構就該筆交易以<span class="red">第十三條帳款疑義處理程序辦理</span>，不受前項約定之限制。<br>
                            持卡人使用信用卡進行郵購買賣或<span class="red">訪問買賣後</span>，依消費者保護法第十九條規定向特約商店解除契約者，準用前項之約定。
                        </div>
                    </div>
                    <div>
                        第十二條（帳單及其他通知）
                        <div class="l-two-em">
                            <span class="red">持卡人之應付帳款如於當期結帳日前發生變動或尚未清償，除持卡人已逾期繳款進入催收程序將依發卡機構催收方式辦理外，發卡機構應按約定依持卡人指定之帳單地址或事先與持卡人約定之電子文件或其他方式寄送帳單。如持卡人於當期繳款截止日起七日前，仍未收到帳單，得向發卡機構查詢，並得請求以掛號郵件、限時郵件、普通郵件、電子文件、傳真或其他適當方式補送，其費用由發卡機構負擔。<br>發卡機構得就正卡及附卡之帳單合併印製。但附卡持卡人得請求提供附卡消費明細清單。<br>持卡人得致電發卡機構消費者服務專線，請求發卡機構免費提供最近二個帳款期間(含當期)內之交易明細。但倘持卡人要求發卡機構提供超過二個帳款期間以前之帳單，發卡機構得按每帳款期間收取新臺幣100元之補發帳單手續費。另如因可歸責於持卡人之事由致每期補送(含當期)帳單次數超逾2次者，發卡機構得按次收取新臺幣100元之補發帳單手續費。發卡機構已依約定方式寄出帳單時，持卡人不得以未收到帳單為由拒絕付款，仍應按約定期限繳款。如有溢繳應付帳款之情形，持卡人得通知發卡機構。發卡機構將持卡人延遲繳款超過一個月以上、強制停卡、催收及呆帳等信用不良之紀錄登錄於聯徵中心前，須於報送五日前將登錄信用不良原因及對持卡人可能之影響情形，以書面或事先與持卡人約定之電子文件告知持卡人。</span><br>
                            持卡人於申請表格所載之聯絡地址或其他聯絡方式
                            <span class="red">（以下均包含電子文件）</span>有所變更而未通知發卡機構者，<span class="red">則以最後通知之聯絡地址或申請表格上所載聯絡地址為發卡機構應為送達之處所</span>。發卡機構將業務上有關文書或應為之通知，向持卡人最後通知之聯絡地址或申請表格所載聯絡地址發出後，經通常郵遞之期間，即推定已合法送達。
                        </div>
                    </div>
                    <div>
                        第十三條（帳款疑義之處理程序）
                        <div class="l-two-em">
                            持卡人於<span class="red">當期繳款截止日前</span>，如<span class="red">對帳單所載</span>之交易明細有疑義，得檢具理由及發卡機構要求之證明文件（如簽帳單或退款單收執聯等）通知發卡機構協助處理，或同意負擔調單手續費<span class="red">（每筆新臺幣100元）</span>後，請發卡機構向收單機構<span class="red">調閱簽帳單或退款單</span>。持卡人請求發卡機構向收單機構<span class="red">調閱簽帳單或退款單時，約定由持卡人給付調單手續費者</span>，如調查結果發現持卡人確係遭人盜刷或帳款疑義非可歸責於持卡人之事由時，其調閱簽帳單手續費由發卡機構負擔。<br>
                            <span class="red">如持卡人主張暫停支付時，於其同意依各信用卡國際組織作業規定繳付帳款疑義處理費用後，得請發卡機構向收單機構或辦理預借現金機構進行扣款、信用卡國際組織仲裁等主張，並得就該筆交易對發卡機構提出暫停付款之要求。<br>因發生疑義而暫停付款之帳款，如持卡人不同意繳付前項帳款疑義處理費用或經發卡機構證明無誤或因非可歸責於發卡機構之事由而不得扣款時，持卡人於受發卡機構通知後應立即繳付之，並自原繳款期限之次日起，以持卡人適用之信用卡循環利率計付利息予發卡機構。<br>持卡人與特約商店發生消費糾紛時，發卡機構應予協助，有疑義時，並應為有利於持卡人之處理。</span>
                        </div>
                    </div>
                    <div>
                        第十四條（繳款）
                        <div class="l-two-em">
                            持卡人於當期繳款截止日前，<span class="red">應繳付當期帳單所載之應付帳款或最低應繳金額以上之帳款</span>。<br>
                            前項繳款截止日，如遇銀行未對外營業之日者，得延至次一營業日。
                            <br>
                            <span class="red">持卡人每期最低應繳金額為以下款次金額之合計（前二款金額合計如低於新臺幣1,000元，則以新臺幣1,000元計收）：</span>
                            <p class="red">一、當期新增一般消費金額及預借現金類產品（係指ATM、電話、臨櫃及網路等）金額百分之十。其它專案型預借現金商品依個別約定條款計算約定。</p>
                            <p class="red">二、前期循環信用餘額之百分之五。</p>
                            <p class="red">三、持卡人每期應付之基金、分期本金。</p>
                            <p class="red">四、前各期逾期未付最低應繳款項之總和。</p>
                            <p class="red">五、超過信用卡額度之款項。</p>
                            <p class="red">六、循環信用利息及年費、違約金、補寄帳單手續費、預借現金手續費、掛失補發手續費、調閱簽帳單手續費等其他應繳費用。</p>
                            <p class="red">七、依持卡人整體信用往來狀況，據以核發信用額度1萬6,000元國民旅遊卡之當期應繳帳款。</p>
                            <p class="red">
                                八、其他經主管機關規定應納入最低應繳金額之交易金額。持卡人應依第一項約定繳款，持卡人就剩餘未付款項得延後付款，且得隨時清償原延後付款金額之全部或一部。已付款項應依序抵沖當期帳款中之費用、利息、前期剩餘未付款項、新增當期帳款之本金，並就抵沖後之帳款餘額，計付循環信用利息。但主管機關規定全額納入最低應繳帳款或不得動用循環信用款項，除費用、利息外，得約定優先於其他帳款抵沖。<br>
                                持卡人如有溢繳應付帳款之情形，應依持卡人指示或雙方約定方式處理。如持卡人無其他約定或特別指示，於領回前由發卡機構無息保管並得以之抵付後續須給付發卡機構之應付帳款。
                                <br>
                                發卡機構對於持卡人到期未續卡，而其帳戶內尚有溢繳款項者，於寄發帳單時，應以顯著文字提醒持卡人並主動聯絡持卡人指示發卡機構處理。
                            </p>
                        </div>
                    </div>
                    <div>
                        第十五條（循環信用利息及違約金）
                        <div class="l-two-em">
                            <span class="red">持卡人應依第十四條第一項約定繳款，並應依第十四條第四項規定計付循環信用利息。發卡機構帳務處理係以身分證字號歸戶，各筆循環信用利息之計算，係將每筆「得計入循環信用本金之帳款」，自各筆帳款入帳日起（每期應付分期本金遲延利息之計算，係自繳款截止日起計算），就該帳款之餘額〈各期一般消費款、預借現金款項及未償還餘額〉以各筆帳款入帳日時應適用之循環信用利率〈約定利率最高為年息15%〉計算至該筆帳款結清之日止（元以下四捨五入）。持卡人於當期繳款截止日前結清全部應付帳款，或繳款後剩餘未付款項不足新臺幣1000元（或等值約定結付外幣），則各筆帳款入帳日後發生之循環信用利息及違約金，不予計收。發卡機構應於核卡同意後通知持卡人適用之循環信用利率。<br>持卡人如未於每月繳款截止日前付清當期最低應繳金額，應依前項約定計付循環信用利息，並同意發卡機構得依本約款收取違約金或催收費用，各帳單週期之違約金計算方式為：</span>
                            <p class="red">一、逾期一期者，當期應繳納違約金新臺幣300元。</p>
                            <p class="red">二、連續逾期二期者，第二期應繳納違約金新臺幣400元。</p>
                            <p>
                                <span class="red">三、連續逾期三期者，第三期應繳納違約金新臺幣500元。<br>持卡人違反約定連續達三期（含）以上者，其違約金連續計收期數最高以三期為限。</span><br>
                                <strong>【範 例】</strong><br>
                                小蓮之信用卡消費明細表(帳單)結帳日為每月3日，繳款截止日為每月18日，2月份小蓮信用卡帳單尚餘循環掛帳金額為3,000元，之後2/19刷卡消費2,000元，該筆消費款銀行入帳日為2/20。小蓮3月份帳單顯示應繳總金額為5,000元，最低應繳金額1,000元。<br>（以年息15％為例計算，個案則因各別利率而異之）<br>
                                <strong>【假設1】</strong><br>3/18繳款截止日，收到小蓮繳納最低應繳金額1,000元，則4/3結帳日，應付上月循環信用利息為61元。因已於繳款截止日收到小蓮繳納最低應繳金額，不計收違約金。<br>《循環信用利息計算說明》<br>($3,000-$1,000)×14天(3/4-3/17) ×15%÷365＝$11.51<br>＋$2,000×26天(2/20-3/17)×15%÷365＝$21.37<br>＋$4,000×17天(3/18-4/3) ×15%÷365＝$27.95<br>
                                合 計 $61元<br>《循環信用利息圖示說明》<br><img src="@/assets/images/terms_img.gif" class="img-fluid" alt="" /><br>
                                <strong>【假設2】</strong><br>承上例，若於3/18繳款截止日，未收到小蓮繳款，則4/3結帳日，應付上月循環信用利息為：$3,000×31天(3/4-4/3)×15%÷365＋$2,000×43天(2/20-4/3)×15%÷365＝74元。因未於繳款截止日收到繳款金額，尚有消費款5,000元未償付，未繳金額在新臺幣1,000元以上且為逾一期，故4/3結帳日計收違約金300元。
                            </p>
                        </div>
                    </div>
                    <div>
                        第十六條（國外交易授權結匯）
                        <div class="l-two-em">
                            持卡人所有使用信用卡交易帳款均應以新臺幣<span class="red">或約定外幣結付</span>，如交易（含辦理退款）之貨幣非為新臺幣，<span class="red">則授權發卡機構依各信用卡國際組織依約所列之結匯日匯率直接換算為新臺幣或約定結付外幣，加計發卡機構應向各該國際組織給付之手續費及發卡機構以交易金額百分之○.五計算之國外交易服務費後結付（元以下四捨五入）。如於國外〈包含與設於國外之網站、特約商店交易〉以新臺幣交易時，亦應依前段加計國外交易手續費及服務費<br>。持卡人授權發卡機構為其在於中華民國境內之結匯代理人，辦理信用卡在國外使用信用卡交易之結匯手續，但持卡人應支付之外幣結匯金額超過法定限額者，持卡人應以外幣支付該超過法定限額之款項。</span>
                        </div>
                    </div>
                    <div>
                        第十七條（卡片遺失等情形）
                        <div class="l-two-em">
                            <span class="red">持卡人之信用卡如有遺失、被竊、被搶、詐取或其他遭持卡人以外之他人占有之情形（以下簡稱遺失等情形），應儘速以電話或其他方式通知發卡機構或其他經發卡機構指定機構辦理掛失手續，並繳交掛失手續費每卡新臺幣200元(無限卡/世界卡/個人商務卡不收取掛失費)。但如發卡機構認有必要時，應於受理掛失手續日起十日內通知持卡人，要求於受通知日起三日內向當地警察機關報案或以書面補行通知發卡機構。持卡人於依發卡機構要求辦理始完成全部手續。<br>持卡人自辦理掛失手續時起被冒用所發生之損失，概由發卡機構負擔。但有下列情形之一者，持卡人仍應負擔辦理掛失手續後被冒用之損失：</span>
                            <p class="red">一、他人之冒用為持卡人容許或故意將信用卡交其使用者。</p>
                            <p class="red">二、持卡人因故意或重大過失將使用自動化設備辦理預借現金或進行其他交易之交易密碼或其他辨識持卡人同一性之方式使第三人知悉者。</p>
                            <div class="red">
                                三、持卡人與他人或特約商店為虛偽不實交易或共謀詐欺者。<br>
                                辦理掛失手續前持卡人被冒用之自負額以新臺幣3000元為上限。但有下列情形者，持卡人免負擔自負額：
                                <div class="l-two-em">
                                    <p class="red">一、持卡人於辦理信用卡掛失手續時起前二十四小時內被冒用者。</p>
                                    <p class="red">二、冒用者在簽單上之簽名，以肉眼即可辨識與持卡人之簽名顯不相同或以善良管理人之注意而可辨識與持卡人之簽名不相同者。</p>
                                    <div class="red">
                                        三、冒用者於發卡機構同意辦理特定金額內免簽名之特約商店進行免簽名交易，經確認非持卡人本人之交易且非持卡人串謀之交易者。<br>
                                        持卡人有本條第二項但書及下列情形之一者，且發卡機構能證明已盡善良管理人之注意義務者，其被冒用之自負額不適用前項約定：
                                        <div class="l-two-em">
                                            <p class="red">
                                                一、持卡人得知信用卡遺失或被竊等情形而怠於立即通知發卡機構，或持卡人發生信用卡遺失或被竊等情形後，自當期繳款截止日起已逾二十日仍未通知發卡機構者。
                                            </p>
                                            <p class="red">二、持卡人違反第八條第一項約定，未於信用卡簽名致他人冒用者。</p>
                                            <p class="red">
                                                三、持卡人於辦理信用卡掛失手續後，未提出發卡機構所請求之文件、拒絕協助調查或其他違反誠信原則之行為者。
                                            </p>
                                        </div>
                                    </div>
                                </div>
                            </div>
                            <span class="red">在自動化設備辦理預借現金及其他必須以交易密碼進行交易部分，對於辦妥掛失停用手續前被冒用所發生之損失，悉由持卡人負擔，不適用本條第三項自負額之約定。</span>
                        </div>
                    </div>
                    <div>
                        第十八條 （遭冒用之特殊交易）
                        <div class="l-two-em">
                            <span class="red">持卡人之信用卡如有遭他人冒用為第九條特殊交易之情形，持卡人應儘速以電話或其他方式通知發卡機構或其他經發卡機構指定機構辦理停卡及換卡手續。但如發卡機構認有必要時，得於受理停卡及換卡手續日起十日內通知持卡人，要求於受通知日起三日內向當地警察機關報案或以書面補行通知發卡機構。<br>持卡人辦理停卡及換卡手續前被冒用所發生之損失，概由發卡機構負擔。但有前條第二項但書或下列情形之一者，持卡人應負擔辦理停卡及換卡手續前被冒用之全部損失：
                            </span>
                            <p class="red">一、持卡人得知信用卡遺失或被竊等情形而怠於立即通知發卡機構，或持卡人發生信用卡遺失或被竊等情形後，自當期繳款截止日起已逾二十日仍未通知發卡機構者。</p>
                            <p class="red">二、持卡人經發卡機構通知辦理換卡，但怠於辦理或拒絕辦理換卡者。</p>
                            <p class="red">三、持卡人於辦理信用卡停卡及換卡手續後，未提出發卡機構所請求之文件、拒絕協助調查或有其他違反誠信原則之行為者。</p>
                        </div>
                    </div>
                    <div>
                        第十九條（補發新卡、換發新卡及屆期續發新卡）
                        <div class="l-two-em">
                            持卡人發生信用卡遺失或被竊等情形或污損、消磁、刮傷或其他原因致令信用卡不堪使用，發卡機構得依持卡人之申請補發新卡。<br>
                            <span class="red">前項情形發生，持卡人應予折斷或繳回發卡機構。如卡片有效期限屆滿或於前項情形發生時持卡人未將卡片折斷或繳回發卡機構，持卡人繼續使用因而致生損害或應付帳款，概由持卡人負責。<br>因信用卡遺失或被竊而向發卡機構要求授權其他信用卡機構代理發給持卡人之緊急替代卡，其效力與發卡機構所發行之信用卡相同。持卡人對該緊急替代卡之消費、預借現金或取得服務，仍適用本契約之全部規定，並負一切清償之責。</span><br>發卡機構於信用卡有效期間屆滿時，如未依第二十三條終止契約者，應續發新卡供持卡人繼續使用。
                            <br>
                            <span class="red">信用卡有效期間屆滿前，持卡人如無續用之意願，須於有效期限屆滿前，事先通知發卡機構終止本契約，或於接獲續發新卡後七日內以書面或以信用卡截斷寄回發卡機構方式通知發卡機構終止本契約，無須說明理由及負擔任何信用卡相關費用或價款，但已使用核發新卡者，不在此限。</span>
                        </div>
                    </div>
                    <div>
                        第二十條（抵銷及抵充）
                        <div class="l-two-em">
                            <span class="red">持卡人經發卡機構依第二十三條主張視為全部到期之權利時，發卡機構得將持卡人寄存於發卡機構之各種存款（支票存款除外）及對發卡機構之其他債權於必要範圍內期前清償，並得將期前清償之款項抵銷持卡人對發卡機構所負本契約之債務。<br>發卡機構預定抵銷之意思表示，應以書面、電子文件或其他持卡人同意之方式通知持卡人，其內容應包括行使抵銷權之事由、抵銷權之種類及數額，並以下列順序辦理抵銷：
                            </span>
                            <p class="red">一、已屆清償期者先抵銷，未屆清償期者後抵銷。</p>
                            <p class="red">二、抵銷存款時，以存款利率低者先抵銷。</p>
                        </div>
                    </div>
                    <div>
                        第二十一條（契約之變更）
                        <div class="l-two-em">
                            本契約約款如有修改或增刪時，發卡機構以<span class="red">書面或電子文件或其他持卡人同意之方式通知</span>持卡人後，持卡人於七日內不為異議者，視同承認該修改或增刪約款。<span class="red">持卡人如有異議，應通知發卡機構終止契約。</span><br>
                            下列事項如有變更，
                            <span class="red">應於變更前六十日以書面或事先與持卡人約定之電子文件通知持卡人，並於該書面或電子文件以顯著明確文字載明其變更事項、新舊約款內容，暨告知持卡人得於變更事項生效前表示異議，及持卡人未於該期間內異議者，視同承認該修改或增刪約款；並告知持卡人如有異議，應於前項異議時間內通知發卡機構終止契約，並得於契約終止後請求按實際持卡月份（不滿一個月者，該月不予計算）比例退還部分年費；</span>
                            <p>一、增加持卡人之可能負擔。</p>
                            <p>二、提高循環信用利率。</p>
                            <p>三、循環信用利率採浮動式者，變更所選擇之指標利率。</p>
                            <p>四、變更循環信用利息計算方式。</p>
                            <p>五、信用卡使用方式及遺失、被竊或滅失時之處理方式。</p>
                            <p>六、持卡人對他人無權使用其信用卡後所發生之權利義務關係。</p>
                            <p>七、有關信用卡交易帳款疑義之處理程序<span class="red">與涉及持卡人權利義務之信用卡國際組織相關重要規範。</span></p>
                            <p class="red">
                                八、提供持卡人之各項權益、優惠或服務之期間及適用條件。<br>
                                發卡機構至少每季應定期覆核持卡人所適用利率。除有不可歸責於發卡機構之事由而有需於提供期間內調整之情形外，或發卡機構已公告或通知之持卡人權益、優惠或服務之期間及適用條件外，發卡機構得每季調整持卡人所適用利率、向持卡人收取之年費、各項手續費、循環信用利息及違約金等之計算方式及可能負擔之一切費用、其他持卡人權益、優惠或服務之期間及適用條件。
                            </p>
                            發卡機構依第一項或第二項通知持卡人變更契約約款時，如持卡人於異議期限內表示異議，並因而終止契約者，發卡機構對於使用循環信用方式或分期付款方式繳款之持卡人，應給予至少六期之緩衝期，但原分期付款剩餘期數小於六期者，依原契約繼續履行。原信用卡契約第四、十四、十五、二十至二十三、二十五至二十九條約定，因繼續履行契約之需要，對發卡機構與持卡人依然有效。
                        </div>
                    </div>
                    <div>
                        第二十二條（信用卡使用之限制）
                        <div class="l-two-em">
                            持卡人<span class="red">如有下列事由之一者，發卡機構無須事先通知或催告，得降低持卡人之信用額度、調整循環信用最低應繳比率或金額或暫時停止持卡人使用信用卡之權利，並應立即通知持卡人：</span>
                            <p>一、持卡人於申請時所填寫或提出之文件不實，或未於信用卡上簽名或將信用卡之占有移轉，或與他人或特約商店偽造虛構不實交易行為或共謀詐欺而以信用卡簽帳方式或其他方式折換金錢或取得利益，或以信用卡向未經主管機關核准或非各信用卡組織委託辦理預借現金之機構或向他人直接或間接取得資金融通。
                            </p>
                            <p>二、持卡人因故意或重大過失而將使用自動化設備辦理預借現金或進行其他交易之交易密碼或其他辨識持卡人同一性之方式告知他人者。</p>
                            <p>三、持卡人連續二期所繳付款項未達發卡機構所定最低應繳金額者。</p>
                            <p>四、持卡人<span class="red">受監護宣告、輔助宣告</span>或依法聲請和解、破產、更生、清算、前置協商、前置調解、公司重整或經票據交換所宣告拒絕往來或停止營業、清理債務者。
                            </p>
                            <p>五、持卡人為法人或非法人團體之法定代理人、代表人、管理人者，關於該法人或非法人團體經票據交換所公告拒絕往來者。</p>
                            <p><span class="red">六、持卡人因刑事而受有期徒刑以上之宣告或沒收主要財產之宣告者。</span> </p>
                            <span class="red">持卡人如有下列事由之一者，經發卡機構事先通知或催告（包含電話、傳真、電子郵件、簡訊、書面及其他持卡人同意之方式），且持卡人無法釋明正當理由，得降低持卡人之信用額度、調整循環信用最低應繳比率或金額。情節重大時，得暫時停止持卡人使用信用卡之權利：</span>
                            <p>一、持卡人違反第二條第二項，發卡機構已依原申請時填載資料之聯絡方式通知而無法取得聯繫者。</p>
                            <p>二、持卡人有一期所繳付款項未達發卡機構所定最低應繳金額者。</p>
                            <p>三、持卡人超過信用額度使用信用卡交易者。</p>
                            <p>四、持卡人存款不足而退票，<span class="red">或其為法人或非法人團體之法定代理人、代表人、管理人，而該法人或非法人團體存款不足而退票者。</span>
                            </p>
                            <p>五、持卡人因本條第一項事由遭其他發卡機構暫停使用信用卡之權利或終止信用卡契約者。</p>
                            <p>六、持卡人主要財產受強制執行或<span class="red">假扣押、假處分或其他保全處分者</span>。 </p>
                            <p>七、持卡人因<span class="red">其他債務</span>、稅務關係被提起訴訟、<span class="red">調查</span>，或因涉及財產犯罪遭刑事<span class="red">偵查</span>或起訴者。</p>
                            <p>八、<span class="red">持卡人依約定負有提供擔保之義務而不提供者。</span></p>
                            <p>九、<span class="red">對發卡機構（包括總機構及分支機構）或其他金融機構有任一債務逾期未償還、有任一債務有遲延繳納本金或利息者，或由親屬、第三人代為處理債務者，或於財團法人金融聯合徵信中心有不良債信紀錄、授信異常者。</span>
                            </p>
                            <p>十、<span class="red">持卡人職業、職務、經濟來源或舉債情形（包含但不限於各金融機構或發卡機構所核發信用卡、現金卡及其他消費性貸款之總額度與往來之狀況）有所變動，有具體事實足供發卡機構降低原先對持卡人信用之評估者或足認持卡人有信用貶落或債務不履行之虞者。</span>
                            </p>
                            <span class="red">發卡機構得為保障持卡人交易安全或維護發卡機構權益，於持卡人有消費異常情形、接獲國際組織或其他銀行通報或發卡機構認為必要之時，於通知持卡人後，就持卡人之信用卡進行控管，包括暫時停卡、永久停卡或主動換卡等作業，持卡人如不願配合者，得終止本契約。<br>持卡人如疑似刷卡採購商品以融資變現、於自己服務之商店或疑似風險特約商店進行非真實消費之刷卡變現行為、至財團法人聯合信用卡處理中心列管之風險特約商店刷卡消費、或有其他異常簽帳時間、地點、項目而可疑有虛偽不實交易或共謀詐欺之情形，或以信用卡為支付工具進行網際網路賭博等不法交易時，發卡機構亦得比照前項方式辦理。<br>前二項情形，如發卡機構無法即時通知持卡人者，持卡人同意發卡機構得先進行控管再通知持卡人。</span><br>發卡機構於第一項或第二項各款事由消滅後，或經發卡機構同意持卡人釋明之理由，或持卡人清償部分款項或提供適當之擔保者，得恢復原核給持卡人之信用額度之全部或一部、原循環信用最低應繳比率或金額或使用信用卡之權利。<br>發卡機構依第一項或第二項調整持卡人循環信用最低應繳比率或金額時，應考慮持卡人過去繳款情形，酌定適當比率或金額。持卡人如有異議，除有第一項第一款或第二款之情形外，發卡機構與持卡人應本誠信原則協商之。
                        </div>
                    </div>
                    <div>
                        第二十三條（喪失期限利益及契約之終止）
                        <div class="l-two-em">
                            <span class="red">持卡人如有前條第一項各款事由之一或本契約終止者，發卡機構無須事先通知或催告，得隨時縮短持卡人延後付款期限或視為全部到期。<br>
                                持卡人如有前條第二項各款事由之一者，經發卡機構事先通知或催告後，發卡機構得隨時縮短持卡人延後付款期限或視為全部到期。持卡人死亡者，亦同。</span>
                            發卡機構於第一項或第二項之事由消滅後，或經發卡機構同意持卡人釋明相當理由，或持卡人清償部分款項或提供適當之擔保者，得恢復持卡人原得延後付款期限或使用循環利息之期限利益。
                            <span class="red">持卡人得隨時將信用卡截斷並註記事由寄回發卡機構或得以書面通知發卡機構終止本契約。</span><br>
                            持卡人如有前條第一項或第二項之事由，或信用卡有效期限屆至者，發卡機構得以
                            <span class="red">書面、電子文件或其他持卡人同意之方式通知</span>持卡人終止契約。<br>
                            <span class="red">本契約終止或解除後，正卡持卡人及附卡持卡人均不得再使用信用卡（含有效期限尚未屆至者）。但如終止或解除其中一種信用卡契約，則僅就該契約發生效力，其他信用卡契約仍為有效。<br>持卡人如依銀行法規定為屬於發卡機構之利害關係者人者，持卡人使用循環信用額度不得超過新臺幣20萬元，超逾時，發卡機構得於通知持卡人後就超逾部分主張到期，並要求持卡人返還超逾部分款項。</span>
                        </div>
                    </div>
                    <div>
                        第二十四條 （其他手續費）
                        <div class="l-two-em">
                            <span class="red">如持卡人以支票付款而未能兌現時，發卡機構每張得加收新臺幣300元手續費。</span><br>
                            如持卡人要求補寄
                            <span class="red">自當月起算三個月〈含〉</span>以上之帳單，發卡機構依每帳款期間得酌收新臺幣100元手續費。<br>
                            <span class="red">本契約終止後，持卡人如已清償全部債務，得請求開立清償證明，每次酌收新臺幣300元手續費。</span><br>
                            持卡人信用卡帳款如有溢繳，得通知發卡機構以匯款方式退款。如要求匯入發卡機構帳戶者，發卡機構得自退回金額中收取新臺幣100元之手續費；
                            <span class="red">如匯入其他金融機構帳戶者，發卡機構得自退回金額中收取新臺幣130元之手續費。</span>
                        </div>
                    </div>
                    <div>
                        第二十五條 （學生持卡注意事項）
                        <div class="l-two-em">
                            二十至二十四歲之持卡人，如於申請之時未填載為學生身分或尚非學生者，嗣後發卡機構如經由其他管道或接獲家長反映其子女為具有學生身分之正卡持卡人，且有超出清償能力刷卡情形時，發卡機構應立即配合持卡人家長處理，並應於財團法人金融聯合徵信中心登錄其學生身分。<br>
                            前項學生或未成年人在使用信用卡時，應該先向父母或家長告知溝通，並藉由信用卡的使用，讓自己學習自主理財的負責態度。發卡機構得因學生及未年人之父母（法定代理人）或家長要求，無須事先通知或催告，停止持卡人使用信用卡之權利。
                            <br>
                            以學生身分申請信用卡者，發卡機構應將發卡情事通知其父母或法定代理人。
                        </div>
                    </div>
                    <div>
                        第二十六條（適用法律）
                        <div class="l-two-em">
                            本契約之準據法為中華民國法律。<br>
                            依本契約發生債權債務之關係，其法律行為之成立要件、效力及方式適用中華民國法律。
                        </div>
                    </div>
                    <div>
                        第二十七條（委外業務之一般處理）
                        <div class="l-two-em">
                            持卡人同意發卡機構之交易帳款收付業務、<span class="red">資料處理業務或其他經主管機關許可得委託他人處理</span>之作業項目，於必要時得委託適當之第三人或與各信用卡組織之會員機構合作辦理。<br>
                            <span class="red">發卡機構依前項規定委外處理業務時，應督促並確保該等資料利用人遵照銀行法及其他相關法令之保密規定，不得將該等有關資料洩漏予第三人。<br>受發卡機構委託處理資料利用人，違反個人資料保護法規定，致個人資料遭不法蒐集、處理、利用或其他侵害持卡人權利者，持卡人得依民法、個人資料保護法或其他相關法令規定，向發卡機構及其委託處理資料利用人請求連帶賠償。</span>
                        </div>
                    </div>
                    <div>
                        第二十八條(委外業務之特別處理－委外催收之告知義務）
                        <div class="l-two-em">
                            <span class="red">持卡人如發生遲延返還應付帳款時，發卡機構得將債務催收作業委外處理，並應於債務委外催收前以書面通知持卡人。通知內容應依相關法令規定，載明受委託機構名稱、催收金額、催收錄音紀錄保存期限，及其他相關事項。<br>發卡機構應將受委託機構基本資料公佈於發卡機構營業場所及網站。<br>發卡機構未依第一項規定通知或受委託機構未依相關法令規定辦理催收，致持卡人受損者，發卡機構應負連帶賠償責任。</span>
                        </div>
                    </div>
                    <div>
                        第二十九條（其他約定事項）
                        <div class="l-two-em">
                            本契約或其他附件各項約定如有未盡事宜，應由雙方另行協議訂定之。<br>
                            持卡人以信用卡代扣各項事業費用、保險費、電信費及其他各類費用等，如持卡人因申請停用、不續卡、發生超額、應付帳款延遲繳款或依約定條款之約定等事由遭發卡機構限制使用信用卡者，發卡機構無須另行通知得逕行終止與持卡人間之代扣約定，持卡人倘因而遭受該事業單位之罰款、停用或其他損失，概由持卡人自行負責。
                            <br>
                            <span class="red">持卡人同意發卡機構因債權讓與、第三人(包含就債之履行有利害關係及無利害關係者)為持卡人代償或承擔債務需要之特定目的，得於為達成前述特定目的之必要範圍內，將持卡人(包含保證人及附卡持卡人)之基本資料及債務相關資料(包括但不限於帳款餘額、利率、利息、違約金、歷史交易紀錄等)提供予前述債權受讓人、債權鑑價查核人及第三人，惟發卡機構應於債權讓與契約約定或以其他方式告知該等資料利用人應遵照銀行法、個人資料保護法及其他相關法令之保密規定，不得將該等有關資料洩漏予其他無關之第三人。<br>持卡人同意發卡機構讓與不良債權予資產管理公司或為金融資產證券化目的而為債權讓與時，得以公告方式取代通知。<br>持卡人同意倘發卡機構與持卡人所持有之聯名／認同卡團體之合作契約終止時，發卡機構得依法在一定期間前以書面通知持卡人原合作契約之終止及換發之信用卡種類，發卡機構得直接換發該書面通知所載之信用卡供持卡人使用，持卡人仍願遵守本契約及各該新換發信用卡約定條款之規定。然持卡人若已持有終止合作之聯名／認同卡以外之發卡機構信用卡，發卡機構亦得不換發其他信用卡供持卡人使用。</span>
                        </div>
                    </div>
                    <div>
                        第三十條（管轄法院）
                        <div class="l-two-em">
                            因本契約涉訟時，雙方同意以臺灣臺北地方法院為第一審法院。
                            <span class="red">但不得排除消費者保護法第四十七條或民事訴訟法第四百三十六條之九規定小額訴訟管轄法院之適用。</span>
                        </div>
                    </div>
                    <div class="text-right mt-4">1711UB</div>
                </div>

            </div>
            <div id="button_terms_3" class="button_terms">
                <input ref="button_termsOpt_3" type="checkbox" id="button_termsOpt_3" v-model="agreement" value="agree3" disabled="" />
                <label id="read_3" for="button_termsOpt_3">我已詳細閱讀。(請勾選)</label>
            </div>
            <!----------------//3-------------------------------------------->

            <!------------------4-------------------------------------------->
            <div ref="termBox4" id="terms_box_4" class="terms_box">
                <!--uc1:wuc電子化帳單服務約定條款 runat="server" id="wuc電子化帳單服務約定條款" /-->
                <div class="txt">
                    <h3>聯邦銀行信用卡「電子化帳單」服務約定條款</h3>
                    申請人玆向 貴行申請辦理「電子化帳單」服務，包括但不限於以行動、EMAIL、即時通訊軟體或其他電子文件形式寄送帳單連結(以下簡稱本服務)，並同意遵守下列條款：
                    <div class="level-one">
                        <div class="cjk-ideographic">
                            一、本服務限正卡人申請，不含商務卡、採購卡(以下簡稱申請人)申請辦理，並依照申請人留存於貴行之手機號碼、指定之電子郵件信箱或以LINE等各種即時通訊軟體為載體作為帳單連結送達位置。
                        </div>
                        <div class="cjk-ideographic">
                            二、申請人可選擇申請之電子化帳單服務包括：行動帳單、EMAIL帳單、LINE帳單等，貴行將依申請人申請的寄送方式，傳送帳單連結至申請之送達位置，申請人可經由該連結跳轉至貴行指定網站開啟電子帳單，其內容包括消費、繳款明細、重要訊息及消費優惠訊息等。申辦本服務後，申請人現有或未來新申請之信用卡帳單，都將以電子化帳單服務取代紙本郵寄帳單之通知服務。
                        </div>
                        <div class="cjk-ideographic">
                            三、<u>申請人申辦本服務後，貴行將於最近一期帳單改以電子化方式寄送，並取消紙本帳單寄送，無須另行通知，每戶限申請一種電子化帳單服務，並依最新一次申請之帳單類別資料為準。</u>
                        </div>
                        <div class="cjk-ideographic">
                            四、<u>為保障申請人的個人資料安全，本服務僅線上保存六個月帳單資料。如選擇行動帳單、LINE帳單，貴行僅提供線上查閱帳單服務，不提供線上下載帳單服務；如須永久保存當期帳單資料，申請人應選擇EMAIL帳單，並自行以貴行提供之連結下載留存。</u>
                        </div>
                        <div class="cjk-ideographic">
                            五、申請EMAIL帳單者，系統將自動提供消費即時通知信件至申請人指定之電子郵件信箱，無須另行通知，若申請人不想收到消費即時通知信件，可至信用卡卡友服務設定或來電客服取消。惟若申請人已申請參加LINE個人化通知服務，貴行將不再提供電子郵件方式通知。
                        </div>
                        <div class="cjk-ideographic">
                            六、本服務通知效力：<br>
                            有關信用卡交易帳款明細資料、依信用卡約定條款或主管機關之規定，應由貴行通知之事項，經貴行依申請人指定之電子化帳單寄送方式為傳送者，其效力與實體書面之郵寄相同。申請人申辦本服務後，即不得以未具書面要件而主張該通知無效。貴行依申請人留存於貴行之手機號碼或指定之電子信箱寄送電子化帳單連結時，將以該通知進入信箱、簡訊或即時通訊軟體之寄送成功紀錄，視為已寄達。
                            <br>
                            申請人同意若申請之行動帳單、EMAIL帳單寄送失敗，貴行當期得改以紙本方式寄送；申請人同意若申請之LINE帳單寄送失敗，貴行當期得改以行動帳單寄送，若無法寄送行動帳單則寄送紙本帳單，惟如電子化帳單與紙本帳單內容不一致時，以紙本帳單所載內容為準。
                            <br>
                            若因非可歸責於貴行之原因造成寄送失敗(包括但不限於電子信箱地址錯誤、變更或取消電子信箱未通知貴行、指定之電子信箱系統異常、電信公司系統異常、手機號碼變更、封鎖或刪除貴行LINE官方帳號等因素)，則以貴行電子化帳單第一次寄送時間視為已寄達。
                        </div>
                        <div class="cjk-ideographic">
                            七、申請人應自行確認留存予貴行之電子郵件信箱資料或手機號碼是否正確無誤，且為有效、足夠之安全性並得正常使用。如申請人變更電子信箱或手機號碼，應立即通知貴行客服(02)2545-5168或(07)226-9393，以避免發生寄送延誤或錯誤之情形。若因申請人留存之電子郵件信箱或手機號碼資料錯誤或未主動通知貴行資料變動所衍生之利息、違約金或其他損失，申請人需自行負責，概與貴行無關。申請人於申辦本服務後，再向
                            貴行另行申請信用卡並填寫有別於原電子信箱者，視為指定之電子信箱變更。
                        </div>
                        <div class="cjk-ideographic">
                            八、終止服務：
                            <div class="level-two">
                                <p class="red">(一) 申請人得隨時通知
                                    貴行終止服務，或連續三期無法依申請人留存之手機號碼、即時通訊軟體或指定之電子郵件信箱寄送電子化帳單，將自最近一期結帳日起恢復紙本帳單寄送。</p>
                                <p class="red">
                                    (二) 如有非外力因素造成本服務無法寄達， 貴行有權變更或終止申請人使用本服務之權利。另有下列任一之情事，貴行有權暫停或終止使用本服務，無須事先通知：
                                    <ol>
                                        <li>申請人有逾期超過四個月繳款之情形。</li>
                                        <li>申請人為債務協商客戶，且協商狀態尚屬協商中或協商成功者。</li>
                                    </ol>
                                </p>
                            </div>
                        </div>
                        <div class="cjk-ideographic">
                            九、暫停服務：如有下列任一情形，貴行得暫停或終止本服務，並應儘速恢復，以繼續提供服務，惟如情況重大短時間無法恢復者， 貴行將以書面帳單進行通知：
                            <div class="level-two">
                                <p class="red">(一) 貴行電子化帳單服務系統或即時通訊進行定期維護或故障排除。</p>
                                <p class="red">(二) 因天災或其他不可歸責貴行之事由致無法提供服務者。</p>
                                <p class="red">(三) 突發性系統設備故障或 貴行協力廠商專線故障。</p>
                            </div>
                        </div>
                        <div class="cjk-ideographic">
                            十、貴行保留增修《聯邦銀行信用卡電子化帳單服務約定條款》之權利，且申請人同意如有變更
                            貴行得以電子文件或書面通知方式通知申請人，申請人如有異議者得立即向貴行要求終止本服務，如申請人自受通知日起七日內未表示異議且持續使用本服務者視為同意 貴行修改之約款。
                        </div>
                        <div class="cjk-ideographic-two">
                            十一、其它約定事項：
                            <div class="level-two">
                                <p class="red">(一)
                                    電子化通知服務：凡依信用卡約定條款或相關法令之規定，應通知持卡人之各該約款、權益或優惠活動事項等相關變動訊息，貴行得以申請人留存之手機號碼、電子郵件、即時通訊軟體或以其他電子文件方式擇一通知，其效力與書面文件相同。
                                </p>
                                <p class="red">(二) 電子化帳單將於每月申請人結帳日後5日內完成寄送，申請人如未收到該月份電子化帳單，應儘速通知 貴行並申請補發，以免延誤繳款。</p>
                                <p class="red">(三)
                                    申請人同意遵守中華民國相關法規及與網際網路使用相關法令、慣例，不得有入侵、破壞或阻止正常運作之意圖或行為，亦不得於網際網路從事違反公共秩序及法律所禁止之行為。
                                </p>
                                <p class="red">(四) 申請人了解並同意於第一次使用LINE通知型服務時，LINE將利用申請人留存於貴行之手機號碼傳送通知型訊息。</p>
                            </div>
                        </div>
                        <div class="cjk-ideographic-two">
                            十二、有關本條款之效力、執行及解釋應依中華民國法律之規定。除另有規定外，因本約定條款所生爭議以台灣台北地方法院為第一審管轄法院，其他未盡事項依信用卡約定條款規定辦理。
                        </div>
                    </div>
                    <div class="text-right mt-4">111.01</div>
                </div>

            </div>
            <div id="button_terms_4" class="button_terms">
                <input ref="button_termsOpt_4" type="checkbox" id="button_termsOpt_4" v-model="agreement" value="agree4" disabled="" />
                <label id="read_4" for="button_termsOpt_4">我已詳細閱讀。(請勾選)</label>
            </div>
            <!----------------//4-------------------------------------------->
          </div>
          <div class="modal-footer">
              <div class="col-12 text-center">
                  <button type="button" class="btn btn-primary btn-lg" @click="checkTotal">確定</button>
              </div>
          </div>
      </div>
    </div>
  </div>
</section>
</template>

<script>
export default {
  data () {
    return {
      agreeModal: '', // ? 同意Modal
      agreement: [], // ? Modal四項同意欄
      agreementAll: false, // ?已同意Modal上所有申請條款
      checkagree: false, // ?同意個資聲明
      cardNumber: {
        code1: '',
        code2: '',
        code3: '',
        code4: ''
      },
      validThru: '',
      CSC: '',
      phoneNumber: ''
    }
  },
  methods: {
    checkValue (dom, code, name, nextid) {
      // ? 清空errors
      dom.setFieldError(name, '')
      switch (name) {
        case '卡號': {
          const idRule = /^\d{4}$/
          if (code.code1) {
            if (!idRule.test(code.code1)) {
              const error = this.$custom.validate.checkCode(code)
              dom.setFieldError(name, error)
            }
            if (idRule.test(code.code1)) {
              if (!this.cardNumber.code2) {
                document.getElementById(nextid).focus()
              }
            }
          }
          if (code.code2) {
            if (!idRule.test(code.code2)) {
              const error = this.$custom.validate.checkCode(code)
              dom.setFieldError(name, error)
            }
            if (idRule.test(code.code2)) {
              if (!this.cardNumber.code3) {
                document.getElementById(nextid).focus()
              }
            }
            this.textHandler2()
          }
          if (code.code3) {
            if (!idRule.test(code.code3)) {
              const error = this.$custom.validate.checkCode(code)
              dom.setFieldError(name, error)
            }
            if (idRule.test(code.code3)) {
              if (!this.cardNumber.code4) {
                document.getElementById(nextid).focus()
              }
            }
            this.textHandler3()
          }
          if (code.code4) {
            if (!idRule.test(code.code4)) {
              const error = this.$custom.validate.checkCode(code)
              dom.setFieldError(name, error)
            }
            if (idRule.test(code.code4)) {
              if (!this.validThru) {
                document.getElementById(nextid).focus()
              }
            }
          }
          if (!code.code1 && !code.code2 && !code.code3 && !code.code4) {
            const error = this.$custom.validate.checkCode(code)
            dom.setFieldError(name, error)
          }
          break
        }
        case '信用卡有效期限': {
          if (this.$custom.validate.checkCode(code) === true) {
            if (nextid) {
              document.getElementById(nextid).focus()
            } else {
              break
            }
          } else {
            const error = this.$custom.validate.checkCode(code)
            dom.setFieldError(name, error)
          }
          break
        }
        case '信用卡背後末三碼': {
          if (this.$custom.validate.checkLast3Code(code) === true) {
            if (nextid) {
              document.getElementById(nextid).focus()
            } else {
              break
            }
          } else {
            const error = this.$custom.validate.checkLast3Code(code)
            // ? 設定errors
            dom.setFieldError(name, error)
          }
          break
        }
        default: {
          const error = this.$custom.validate.checkCode(code)
          // ? 設定errors
          dom.setFieldError(name, error)
          break
        }
      }
      // if (this.$custom.validate.checkCode(code) === true) {
      //   document.getElementById(nextid).focus()
      // } else {
      //   // ? 清空errors
      //   dom.setFieldError(name, '')
      //   const error = this.$custom.validate.checkCode(code)
      //   // ? 設定errors
      //   dom.setFieldError(name, error)
      // }
    },
    textHandler2 () {
      document.getElementById('cardCode2').setAttribute('type', 'text')
      setTimeout(() => {
        document.getElementById('cardCode2').setAttribute('type', 'password')
      }, 1000)
    },
    textHandler3 () {
      document.getElementById('cardCode3').setAttribute('type', 'text')
      setTimeout(() => {
        document.getElementById('cardCode3').setAttribute('type', 'password')
      }, 1000)
    },
    scrollEvent () {
      for (let i = 1; i < 5; i++) {
        this.$refs[`termBox${i}`].onscroll = function () {
          if (this.scrollHeight - this.scrollTop <= this.clientHeight + 50) {
            const btn = document.querySelector(`#button_termsOpt_${i}`)
            const label = document.querySelector(`#read_${i}`)
            btn.removeAttribute('disabled')
            label.classList.add('text-checked')
          }
        }
      }
    },
    toggle () {
      const ck = document.querySelector('#agree1').checked
      if (ck) {
        this.checkagree = true
      } else {
        this.checkagree = false
      }
    },
    checkAgreement () {
      this.agreeModal.show()
      const ck = document.querySelector('#checkbox1')
      if (this.agreement.length !== 4) {
        ck.checked = false
        return
      }
      this.agreementAll = true
      ck.checked = true
    },
    // ?modal上四欄位確認
    checkTotal () {
      if (this.agreement.length < 4) {
        this.$swal.fire({
          title: '您尚有部份條款未勾選，請詳閱並同意全部條款，以確保自身權益！',
          showConfirmButton: false,
          timer: 2500
        })
        return
      }
      this.agreementAll = true
      const ck = document.querySelector('#checkbox1')
      ck.checked = true
      this.agreeModal.hide()
    },
    async applySubmit (dom) {
      this.checkValue(this.$refs.myForm, this.cardNumber, '卡號', '')
      this.checkValue(this.$refs.myForm, this.validThru, '信用卡有效期限', '')
      this.checkValue(this.$refs.myForm, this.CSC, '信用卡背後末三碼', '')
      // ?先取得套件rules的errors
      const collection = await dom.validate()
      // ?再整合取得自訂驗證的errors
      collection.errors = dom.getErrors()
      // *   ====送單判斷====
      // ? 信用卡欄位
      if (Object.keys(collection.errors).length === 0) {
        // ? 檢查四項條款 或 個資使用同意 未打勾
        if (!this.agreementAll || !this.checkagree) {
          this.$swal.fire({
            title: '您尚有部份條款未勾選，請詳閱並同意全部條款，以確保自身權益！',
            showConfirmButton: false,
            customClass: {
              title: 'text-class'
            }
          })
          return
        }
        // ** ===全部檢查通過前往下一頁===
        this.$router.push('/OnLineApply_Chk_OTP')
      } else {
        // ** ===錯誤訊息彙整===
        this.$custom.validate.showErrors(collection.errors)
      }
    }
  },
  watch: {
    agreement (n) {
      if (this.agreement) {
        this.agreementAll = true
      } else {
        this.agreementAll = false
      }
    },
    checkagree (n) {
      if (n === 'agree') {
        this.checkagree = true
      } else if (n) {
        this.checkagree = true
      } else {
        this.checkagree = false
      }
    }
  },
  mounted () {
    this.scrollEvent()
    this.agreeModal = new this.$custom.bootstrap.Modal(this.$refs.agreeModal, { backdrop: 'static' })
  }
}
</script>

<style lang="css">
  /* .invalid-feedback.card-code {
    font-size: 0.5em !important;
    width: 4rem;
  } */
  .formList #group1{
    margin-bottom: 2rem !important;
  }

</style>
